{
    "Infusions": "FoldUnfold\nTable of Contents\n\nArcane Propulsion Armor\nArmor of Magical Strength\nArmor of Tools (UA)\nBoots of the Winding Path\nEnhanced Arcane Focus\nEnhanced Defense\nEnhanced Weapon\nHelm of Awareness\nHomunculus Servant\nMind Sharpener\nRadiant Weapon\nRepeating Shot\nReplicate Magic Item\nRepulsion Shield\nResistant Armor\nReturning Weapon\nSpell-Refueling Ring\n\n\nArcane Propulsion Armor\nPrerequisite: 14th-level artificer\nItem: A suit of armor (requires attunement)\nThe wearer of this armor gains these benefits:\n\nThe wearer's walking speed increases by 5 feet.\n\n\nThe armor includes gauntlets, each of which is a magic melee weapon that can be wielded only when the hand is holding nothing. The wearer is proficient with the gauntlets, and each one deals 1d8 force damage on a hit and has the thrown property, with a normal range of 20 feet and a long range of 60 feet. When thrown, the gauntlet detaches and flies at the attack's target, then immediately returns to the wearer and reattaches.\n\n\nThe armor can't be removed against the wearer's will.\n\n\nIf the wearer is missing any limbs, the armor replaces those limbs - hands, arms, feet, legs, or similar appendages. The replacements function identically to the body parts they replace.\n\nArmor of Magical Strength\nItem: A suit of armor (requires attunement)\nThis armor has 6 charges. The wearer can expend the armor's charges in the following ways:\n\nWhen the wearer makes a Strength check or a Strength saving throw, it can expend 1 charge to add a bonus to the roll equal to its Intelligence modifier.\n\n\nIf the creature would be knocked prone, it can use its reaction to expend 1 charge to avoid being knocked prone.\n\nThe armor regains 1d6 expended charges daily at dawn.\nArmor of Tools (UA)\nItem: A suit of armor\nAs an action, a creature wearing this infused armor can integrate into it artisan’s tools or thieves’ tools. The tools remain integrated in the armor for 8 hours or until the wearer removes the tools as an action. The armor can have only one tool integrated at a time. The wearer can add its Intelligence modifier to any ability checks it makes with the integrated tool. The wearer must have a hand free to use the tool.\nBoots of the Winding Path\nPrerequisite: 6th-level artificer\nItem: A pair of boots (requires attunement)\nWhile wearing these boots, a creature can teleport up to 15 feet as a bonus action to an unoccupied space the creature can see. The creature must have occupied that space at some point during the current turn.\nEnhanced Arcane Focus\nItem: A rod, staff or wand (requires attunement)\nWhile holding this item, a creature gains +1 bonus to spell attack rolls. In addition, the creature ignores half cover when making a spell attack.\nThe bonus increases to +2 when you reach 10th level in this class.\nEnhanced Defense\nItem: A suit of armor or a shield\nA creature gains a +1 bonus to Armor Class while wearing (armor) or wielding (shield) the infused item.\nThe bonus increases to +2 when you reach 10th level in this class.\nEnhanced Weapon\nItem: A simple or martial weapon\nThis magic weapon grants a +1 bonus to attack and damage rolls made with it.\nThe bonus increases to +2 when you reach 10th level in this class.\nHelm of Awareness\nPrerequisite: 10th-level artificer\nItem: A helmet (requires attunement)\nWhile wearing this helmet, a creature has advantage on initiative rolls. In addition, the wearer can’t be surprised, provided it isn’t incapacitated.\nHomunculus Servant\nItem: A gem or crystal worth at least 100 gp\nYou learn intricate methods for magically creating a special homunculus that serves you. The item you infuse serves as the creature's heart, around which the creature's body instantly forms.\nYou determine the homunculus's appearance. Some artificers prefer mechanical-looking birds, whereas some like winged vials or miniature, animate cauldrons.\nThe homunculus is friendly to you and your companions, and it obeys your commands. See this creature's game statistics in the Homunculus Servant stat block, which uses your proficiency bonus (PB) in several places.\nIn combat, the homunculus shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the Dodge action, unless you take a bonus action on your turn to command it to take another action. That action can be one in its stat block or some other action. If you are incapacitated, the homunculus can take any action of its choice, not just Dodge.\nThe homunculus regains 2d6 hit points if the mending spell is cast on it. If you or the homunculus dies, it vanishes, leaving its heart in its space.\n\n\nHomunculus Servant\n\n\nTiny construct\n\n\nArmor Class: 13 (natural armor)\n\n\nHit Points: 1 + your Intelligence modifier + your artificer level (the homunculus has a number of Hit Dice [d4s] equal to your artificer level)\n\n\nSpeed: 20 ft., fly 30 ft.\n\n\nSTR\nDEX\nCON\nINT\nWIS\nCHA\n\n\n4 (-3)\n15 (+2)\n12 (+1)\n10 (+0)\n10 (+0)\n7 (−2)\n\n\nSaving Throws: Dex +2 plus PB\n\n\nSkills: Perception +0 plus PB x 2, Stealth +2 plus PB\n\n\nDamage Immunities: poison\n\n\nCondition Immunities: exhaustion, poisoned\n\n\nSenses: darkvision 60 ft., passive Perception 10 + (PB x 2)\n\n\nLanguages: understands the languages you speak\n\n\nChallenge: —\n\n\nProficiency Bonus (PB): equals your bonus\n\n\nEvasion. If the homunculus is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails. It can't use this trait if it's incapacitated.\n\n\nActions\n\n\nForce Strike. Ranged Weapon Attack: your spell attack modifier to hit, range 30 ft., one target you can see. Hit: 1d4 + PB force damage.\n\n\nReactions\n\n\nChannel Magic. The homunculus delivers a spell you cast that has a range of touch. The homunculus must be within 120 feet of you.\n\n\nMind Sharpener\nItem: A suit of armor or robes\nThe infused item can send a jolt to the wearer to refocus their mind. The item has 4 charges. When the wearer fails a Constitution saving throw to maintain concentration on a spell, the wearer can use its reaction to expend 1 of the item's charges to succeed instead. The item regains 1d4 expended charges daily at dawn.\nRadiant Weapon\nPrerequisite: 6th-level artificer\nItem: A simple or martial weapon (requires attunement)\nThis magic weapon grants a +1 bonus to attack and damage rolls made with it. While holding it, the wielder can take a bonus action to cause it to shed bright light in a 30-foot radius and dim light for an additional 30 feet. The wielder can extinguish the light as a bonus action.\nThe weapon has 4 charges. As a reaction immediately after being hit by an attack, the wielder can expend 1 charge and cause the attacker to be blinded until the end of the attacker's next turn, unless the attacker succeeds on a Constitution saving throw against your spell save DC. The weapon regains 1d4 expended charges daily at dawn.\nRepeating Shot\nItem: A simple or martial weapon with the ammunition property (requires attunement)\nThis magic weapon grants a +1 bonus to attack and damage rolls made with it when it's used to make a ranged attack, and it ignores the loading property if it has it.\nIf the weapon lacks ammunition, it produces its own, automatically creating one piece of magic ammunition when the wielder makes a ranged attack with it. The ammunition created by the weapon vanishes the instant after it hits or misses a target.\nReplicate Magic Item\nUsing this infusion, you replicate a particular magic item. You can learn this infusion multiple times; each time you do so, choose a magic item that you can make with it, picking from the Replicable Items tables. A table's title tells you the level you must be in the class to choose an item from the table. Alternatively, you can choose the magic item from among the common magic items in the game, not including potions or scrolls.\nIn the tables, an item's entry tells you whether the item requires attunement. See the item's description in the Dungeon Master's Guide for more information about it, including the type of object required for its making.\nIf you have Xanathar's Guide to Everything, you can choose from among the common magic items in that book when you pick a magic item you can replicate with this infusion.\n\n\nReplicable Magic Items (2nd-Level Artificer)\n\n\nMagic Item\nAttunement\n\n\nAlchemy Jug\nNo\n\n\nBag of Holding\nNo\n\n\nCap of Water Breathing\nNo\n\n\nGoggles of Night\nNo\n\n\nRope of Climbing\nNo\n\n\nSending Stones\nNo\n\n\nWand of Magic Detection\nNo\n\n\nWand of Secrets\nNo\n\n\n\n\nReplicable Magic Items (6th-Level Artificer)\n\n\nMagic Item\nAttunement\n\n\nBoots of Elvenkind\nNo\n\n\nCloak of Elvenkind\nYes\n\n\nCloak of the Manta Ray\nNo\n\n\nEyes of Charming\nYes\n\n\nGloves of Thievery\nNo\n\n\nLantern of Revealing\nNo\n\n\nPipes of Haunting\nNo\n\n\nRing of Water Walking\nNo\n\n\n\n\nReplicable Magic Items (10th-level artificer)\n\n\nMagic Item\nAttunement\n\n\nBoots of Striding and Springing\nYes\n\n\nBoots of the Winterlands\nYes\n\n\nBracers of Archery\nYes\n\n\nBrooch of Shielding\nYes\n\n\nCloak of Protection\nYes\n\n\nEyes of the Eagle\nYes\n\n\nGauntlets of Ogre Power\nYes\n\n\nGloves of Missile Snaring\nYes\n\n\nGloves of Swimming and Climbing\nYes\n\n\nHat of Disguise\nYes\n\n\nHeadband of Intellect\nYes\n\n\nHelm of Telepathy\nYes\n\n\nMedallion of Thoughts\nYes\n\n\nNecklace of Adaptation\nYes\n\n\nPeriapt of Wound Closure\nYes\n\n\nPipes of the Sewers\nYes\n\n\nQuiver of Ehlonna\nNo\n\n\nRing of Jumping\nYes\n\n\nRing of Mind Shielding\nYes\n\n\nSlippers of Spider Climbing\nYes\n\n\nVentilating Lungs (Eberron: Rising from the Last War)\nYes\n\n\nWinged Boots\nYes\n\n\n\n\nReplicable Magic Items (14th-level artificer)\n\n\nMagic Item\nAttunement\n\n\nAmulet of Health\nYes\n\n\nArcane Propulsion Arm (Eberron: Rising from the Last War)\nYes\n\n\nBelt of Hill Giant Strength\nYes\n\n\nBoots of Levitation\nYes\n\n\nBoots of Speed\nYes\n\n\nBracers of Defense\nYes\n\n\nCloak of the Bat\nYes\n\n\nDimensional Shackles\nNo\n\n\nGem of Seeing\nYes\n\n\nHorn of Blasting\nNo\n\n\nRing of Free Action\nYes\n\n\nRing of Protection\nYes\n\n\nRing of the Ram\nYes\n\n\nRepulsion Shield\nPrerequisite: 6th-level artificer\nItem: A shield (requires attunement)\nA creature gains a +1 bonus to Armor Class while wielding this shield.\nThe shield has 4 charges. While holding it, the wielder can use a reaction immediately after being hit by a melee attack to expend 1 of the shield's charges and push the attacker up to 15 feet away. The shield regains 1d4 expended charges daily at dawn.\nResistant Armor\nPrerequisite: 6th-level artificer\nItem: A suit of armor (requires attunement)\nWhile wearing this armor, a creature has resistance to one of the following damage types, which you choose when you infuse the item: acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder.\nReturning Weapon\nItem: A simple or martial weapon with the thrown property\nThis magic weapon grants a +1 bonus to attack and damage rolls made with it, and it returns to the wielder’s hand immediately after it is used to make a ranged attack.\nSpell-Refueling Ring\nPrerequisite: 6th-level artificer\nItem: A ring (requires attunement)\nWhile wearing this ring, the creature can recover one expended spell slot as an action. The recovered slot can be of 3rd level or lower. Once used, the ring can't be used again until the next dawn.",
    "Blood Curse": "FoldUnfold\nTable of Contents\n\nBlood Curse of the Anxious\nBlood Curse of Binding\nBlood Curse of Bloated Agony\nBlood Curse of Corrosion\nBlood Curse of the Exorcist\nBlood Curse of Exposure\nBlood Curse of the Eyeless\nBlood Curse of the Fallen Puppet\nBlood Curse of the Howl\nBlood Curse of the Marked\nBlood Curse of the Muddled Mind\nBlood Curse of the Soul Eater\n\n\n\n\n\nBlood Curse of the Anxious\nAs a bonus action, you harry the body or mind of a creature within 30 feet of you, making them susceptible to forceful influence. Until the end of your next turn, Charisma (Intimidation) checks made against the cursed creature have advantage.\nAmplify. The next Wisdom saving throw the cursed creature makes before this curse ends has disadvantage.\nBlood Curse of Binding\nAs a bonus action, you attempt to bind a Large or smaller creature you can see within 30 feet of you, which must make a Strength saving throw. On a failure, the cursed creature’s speed is reduced to 0 and it can’t use reactions until the end of your next turn.\nAmplify. This curse lasts for 1 minute and can affect any creature regardless of size. The cursed creature can repeat the saving throw at the end of each of its turns, ending the curse on itself on a success.\nBlood Curse of Bloated Agony\nAs a bonus action, you curse a creature that you can see within 30 feet of you, causing its body to swell until the end of your next turn. For the duration, the creature has disadvantage on Strength checks and Dexterity checks, and takes 1d8 necrotic damage if it makes more than one attack during its turn.\nAmplify. This curse lasts for 1 minute. The cursed creature can make a Constitution saving throw at the end of each of its turns, ending the curse on itself on a success.\nBlood Curse of Corrosion\nPrerequisite: 15th level, Order of the Mutant\nAs a bonus action, you cause a creature within 30 feet of you to become poisoned. The cursed creature can make a Constitution saving throw at the end of each of its turns, ending the curse on itself on a success.\nAmplify. The cursed creature takes 4d6 necrotic damage when you inflict this curse, and it takes this damage again each time it fails a Constitution saving throw to end the curse.\nBlood Curse of the Exorcist\nPrerequisite: 15th level, Order of the Ghostslayer\nAs a bonus action, you choose one creature you can see within 30 feet of you that is charmed or frightened, or which is under a possession effect. The target creature is no longer charmed, frightened, or possessed.\nAmplify. A creature that charmed, frightened, or possessed the target of your curse takes 3d6 psychic damage and must succeed on a Wisdom saving throw or be stunned until the end of your next turn.\nBlood Curse of Exposure\nWhen a creature you can see within 30 feet of you takes damage from an attack or spell, you can use your reaction to temporarily weaken its resilience. Until the end of the target’s next turn, it loses resistance to all the damage types dealt by the triggering attack or spell (including for that triggering effect).\nAmplify. The target instead loses invulnerability to the damage types of the triggering attack or spell, but has resistance to those damage types until the end of its next turn.\nBlood Curse of the Eyeless\nWhen a creature you can see within 30 feet of you makes an attack, you can use your reaction to roll one hemocraft die and subtract the number rolled from the creature’s attack roll. You can choose to use this feature after the creature’s roll, but before the DM determines whether the attack hits or misses. The creature is immune to this curse if it is immune to the blinded condition.\nAmplify. You apply this curse to all the creature’s attack rolls until the end of the creature’s turn. You roll separately for each affected attack.\nBlood Curse of the Fallen Puppet\nWhen a creature you can see within 30 feet of you drops to 0 hit points, you can use your reaction to instill that creature with a final act of aggression. The creature immediately makes one weapon attack against a target of your choice within its range.\nAmplify. You can first cause the cursed creature to move up to half its speed, and you grant a bonus to its attack roll equal to your Hemocraft modifier (minimum of +1).\nBlood Curse of the Howl\nPrerequisite: 18th level, Order of the Lycan\nAs an action, you unleash a bloodcurdling howl. Each creature within 30 feet of you that can hear you must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn. If a creature fails its saving throw by 5 or more, it is stunned while frightened in this way. A creature that succeeds on its saving throw is immune to this blood curse for the next 24 hours.\nYou can choose any number of creatures you can see to be unaffected by the howl.\nAmplify. The range of this curse increases to 60 feet.\nBlood Curse of the Marked\nAs a bonus action, you mark a creature that you can see within 30 feet of you. Until the end of your turn, whenever you hit the cursed creature with a weapon for which you have an active crimson rite, you roll an additional hemocraft die when determining the extra damage from the rite.\nAmplify. The next attack roll you make against the target before the end of your turn has advantage.\nBlood Curse of the Muddled Mind\nAs a bonus action, you curse a creature that you can see within 30 feet of you that is concentrating on a spell or using a feature that requires concentration. That creature has disadvantage on the next Constitution saving throw it makes to maintain concentration before the end of your next turn.\nAmplify. The cursed creature has disadvantage on all Constitution saving throws made to maintain concentration until the end of your next turn.\nBlood Curse of the Soul Eater\nPrerequisite: 18th level, Order of the Profane Soul\nWhen a creature that isn’t a construct or undead is reduced to 0 hit points within 30 feet of you, you can use your reaction to offer their life energy to your patron in exchange for power. Until the end of your next turn, you make attacks with advantage and you have resistance to all damage.\nAmplify. Additionally, you regain an expended warlock spell slot. Once you’ve amplified this blood curse, you must finish a long rest before you can amplify it again.",
    "Mutagens": "FoldUnfold\nTable of Contents\n\nAether\nAlluring\nCelerity\nConversant\nCruelty\nDeftness\nEmbers\nGelid\nImpermeable\nMobility\nNighteye\nPercipient\nPotency\nPrecision\nRapidity\nReconstruction\nSagacity\nShielded\nUnbreakable\nVermillion\n\n\nAether\nPrerequisite: 11th Level\nYou have a flying speed of 20 feet for 1 hour. However, you have disadvantage on Strength checks and Dexterity checks during this time.\nAlluring\nYour skin and voice become malleable, allowing you to enhance your appearance and presence. You have advantage on Charisma checks. However, you have disadvantage on initiative rolls.\nCelerity\nYour Dexterity score increases by 3, as does your maximum for that score. However, you have disadvantage on Wisdom saving throws. Your Dexterity score and your maximum increase by 4 if you consume this mutagen at 11th level, and by 5 at 18th level.\nConversant\nYou have advantage on Intelligence checks. However, you have disadvantage on Wisdom checks.\nCruelty\nPrerequisite: 11th level\nWhen you use the Attack action, you can make one additional weapon attack as a bonus action. However, you have disadvantage on Intelligence, Wisdom, and Charisma saving throws.\nDeftness\nYou have advantage on Dexterity checks. However, you have disadvantage on Wisdom checks.\nEmbers\nYou have resistance to fire damage and vulnerability to cold damage.\nGelid\nYou have resistance to cold damage and vulnerability to fire damage.\nImpermeable\nYou have resistance to piercing damage and vulnerability to slashing damage.\nMobility\nYou have immunity to the grappled and restrained conditions. However, you have disadvantage on Strength checks. At 11th level, you are also immune to the paralyzed condition.\nNighteye\nYou have darkvision out to a range of 60 feet. If you already have darkvision, its range increases by 60 feet. However, you have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.\nPercipient\nYou have advantage on Wisdom checks. However, you have disadvantage on Charisma checks.\nPotency\nYour Strength score increases by 3, as does your maximum for that score. However, you have disadvantage on Dexterity saving throws. Your Strength score and your maximum increase by 4 if you consume this mutagen at 11th level, and by 5 at 18th level.\nPrecision\nPrerequisite: 11th level\nYour weapon attacks score a critical hit on a roll of 19 or 20. However, you have disadvantage on Strength saving throws.\nRapidity\nYour speed increases by 10 feet. However, you have disadvantage on Intelligence checks. At 15th level, your speed increases by an additional 5 feet.\nReconstruction\nPrerequisite: 7th level\nFor 1 hour, at the start of each of your turns when you have at least 1 hit point but fewer hit points than half your hit point maximum, you regain hit points equal to your proficiency bonus. However, your speed is reduced by 10 feet during this time.\nSagacity\nYour Intelligence score increases by 3, as does your maximum for that score. However, you have disadvantage on Charisma saving throws. Your Intelligence score and your maximum increase by 4 if you consume this mutagen at 11th level, and by 5 at 18th level.\nShielded\nYou have resistance to slashing damage, and you have vulnerability to bludgeoning damage.\nUnbreakable\nYou have resistance to bludgeoning damage, and you have vulnerability to piercing damage.\nVermillion\nYou gain an additional use of your Blood Maledict feature. However, you have disadvantage on death saving throws.",
    "Battle Maneuvers": "FoldUnfold\nTable of Contents\n\nAmbush\nBait and Switch\nBrace\nCommander's Strike\nCommanding Presence\nDisarming Attack\nDistracting Strike\nEvasive Footwork\nFeinting Attack\nGoading Attack\nGrappling Strike\nLunging Attack\nManeuvering Attack\nMenacing Attack\nParry\nPrecision Attack\nPushing Attack\nQuick Toss\nRally\nRiposte\nSweeping Attack\nTactical Assessment\nTrip Attack\n\n\nAmbush\nWhen you make a Dexterity (Stealth) check or an initiative roll, you can expend one superiority die and add the die to the roll, provided you aren't incapacitated.\nBait and Switch\nWhen you're within 5 feet of a creature on your turn, you can expend one superiority die and switch places with that creature, provided you spend at least 5 feet of movement and the creature is willing and isn't incapacitated. This movement doesn't provoke opportunity attacks.\nRoll the superiority die. Until the start of your next turn, you or the other creature (your choice) gains a bonus to AC equal to the number rolled.\nBrace\nWhen a creature you can see moves into the reach you have with the melee weapon you're wielding, you can use your reaction to expend one superiority die and make one attack against the creature, using that weapon. If the attack hits, add the superiority die to the weapon's damage roll.\nCommander's Strike\nWhen you take the Attack action on your turn, you can forgo one of your attacks and use a bonus action to direct one of your companions to strike. When you do so, choose a friendly creature who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding the superiority die to the attack's damage roll.\nCommanding Presence\nWhen you make a Charisma (Intimidation), a Charisma (Performance), or a Charisma (Persuasion) check, you can expend one superiority die and add the superiority die to the ability check.\nDisarming Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it's holding. You add the superiority die to the attack's damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. The object lands at its feet.\nDistracting Strike\nWhen you hit a creature with a weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack's damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn.\nEvasive Footwork\nWhen you move, you can expend one superiority die, rolling the die and adding the number rolled to your AC until you stop moving.\nFeinting Attack\nYou can expend one superiority die and use a bonus action on your turn to feint, choosing one creature within 5 feet of you as your target. You have advantage on your next attack roll against that creature this turn. If that attack hits, add the superiority die to the attack's damage roll.\nGoading Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to attempt to goad the target into attacking you. You add the superiority die to the attack's damage roll, and the target must make a Wisdom saving throw. On a failed save, the target has disadvantage on all attack rolls against targets other than you until the end of your next turn.\nGrappling Strike\nImmediately after you hit a creature with a melee attack on your turn, you can expend one superiority die and then try to grapple the target as a bonus action (see the Player's Handbook for rules on grappling). Add the superiority die to your Strength (Athletics) check.\nLunging Attack\nWhen you make a melee weapon attack on your turn, you can expend one superiority die to increase your reach for that attack by 5 feet. If you hit, you add the superiority die to the attack's damage roll.\nManeuvering Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to maneuver one of your comrades into a more advantageous position. You add the superiority die to the attack's damage roll, and you choose a friendly creature who can see or hear you. That creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack.\nMenacing Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to attempt to frighten the target. You add the superiority die to the attack's damage roll, and the target must make a Wisdom saving throw. On a failed save, it is frightened of you until the end of your next turn.\nParry\nWhen another creature damages you with a melee attack, you can use your reaction and expend one superiority die to reduce the damage by the number you roll on your superiority die + your Dexterity modifier.\nPrecision Attack\nWhen you make a weapon attack roll against a creature, you can expend one superiority die to add it to the roll. You can use this maneuver before or after making the attack roll, but before any effects of the attack are applied.\nPushing Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to attempt to drive the target back. You add the superiority die to the attack's damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you push the target up to 15 feet away from you.\nQuick Toss\nAs a bonus action, you can expend one superiority die and make a ranged attack with a weapon that has the thrown property. You can draw the weapon as part of making this attack. If you hit, add the superiority die to the weapon's damage roll.\nRally\nOn your turn, you can use a bonus action and expend one superiority die to bolster the resolve of one of your companions. When you do so, choose a friendly creature who can see or hear you. That creature gains temporary hit points equal to the superiority die roll + your Charisma modifier.\nRiposte\nWhen a creature misses you with a melee attack, you can use your reaction and expend one superiority die to make a melee weapon attack against the creature. If you hit, you add the superiority die to the attack's damage roll.\nSweeping Attack\nWhen you hit a creature with a melee weapon attack, you can expend one superiority die to attempt to damage another creature with the same attack. Choose another creature within 5 feet of the original target and within your reach. If the original attack roll would hit the second creature, it takes damage equal to the number you roll on your superiority die. The damage is of the same type dealt by the original attack.\nTactical Assessment\nWhen you make an Intelligence (Investigation), an Intelligence (History), or a Wisdom (Insight) check, you can expend one superiority die and add the superiority die to the ability check.\nTrip Attack\nWhen you hit a creature with a weapon attack, you can expend one superiority die to attempt to knock the target down. You add the superiority die to the attack's damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you knock the target prone.",
    "Disciplines": "FoldUnfold\nTable of Contents\n\nBreath of Winter\nClench of the North Wind\nElemental Attunement\nEternal Mountain Defense\nFangs of the Fire Snake\nFist of Four Thunders\nFist of Unbroken Air\nFlames of the Phoenix\nGong of the Summit\nMist Stance\nRide the Wind\nRiver of Hungry Flame\nRush of the Gale Spirits\nShape the Flowing River\nSweeping Cinder Strike\nWater Whip\nWave of Rolling Earth\n\n\nBreath of Winter\nPrerequisite: 17th Level\nYou can spend 6 ki points to cast Cone of Cold.\nClench of the North Wind\nPrerequisite: 6th Level\nYou can spend 3 ki points to cast Hold Person.\nElemental Attunement\nYou can use your action to briefly control elemental forces within 30 feet of you, causing one of the following effects of your choice:\n\nCreate a harmless, instantaneous sensory effect related to air, earth, fire, or water such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone.\nInstantaneously light or snuff out a candle, a torch, or a small campfire.\nChill or warm up to 1 pound of nonliving material for up to 1 hour.\nCause earth, fire, water, or mist that can fit within a 1-foot cube to shape itself into a crude form you designate for 1 minute.\n\nEternal Mountain Defense\nPrerequisite: 17th Level\nYou can spend 5 ki points to cast Stoneskin, targeting yourself.\nFangs of the Fire Snake\nWhen you use the Attack action on your turn, you can spend 1 ki point to cause tendrils of flame to stretch out from your fists and feet. Your reach with your unarmed strikes increases by 10 feet for that action, as well as the rest of the turn. A hit with such an attack deals fire damage instead of bludgeoning damage, and if you spend 1 ki point when the attack hits, it also deals an extra 1d10 fire damage.\nFist of Four Thunders\nYou can spend 2 ki points to cast Thunderwave.\nFist of Unbroken Air\nYou can create a blast of compressed air that strikes like a mighty fist. As an action, you can spend 2 ki points and choose a creature within 30 feet of you. That creature must make a Strength saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can push the creature up to 20 feet away from you and knock it prone. On a successful save, the creature takes half as much damage, and you don't push it or knock it prone.\nFlames of the Phoenix\nPrerequisite: 11th Level\nYou can spend 4 ki points to cast Fireball.\nGong of the Summit\nPrerequisite: 6th Level\nYou can spend 3 ki points to cast Shatter.\nMist Stance\nPrerequisite: 11th Level\nYou can spend 4 ki points to cast Gaseous Form, targeting yourself.\nRide the Wind\nPrerequisite: 11th Level\nYou can spend 4 ki points to cast Fly, targeting yourself.\nRiver of Hungry Flame\nPrerequisite: 17th Level\nYou can spend 5 ki points to cast Wall of Fire.\nRush of the Gale Spirits\nYou can spend 2 ki points to cast Gust of Wind.\nShape the Flowing River\nAs an action, you can spend 1 ki point to choose an area of ice or water no larger than 30 feet on a side within 120 feet of you. You can change water to ice within the area and vice versa, and you can reshape ice in the area in any manner you choose. You can raise or lower the ice's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. For example, if you affect a 30-foot square, you can create a pillar up to 15 feet high, raise or lower the square's elevation by up to 15 feet, dig a trench up to 15 feet deep, and so on. You can't shape the ice to trap or injure a creature in the area.\nSweeping Cinder Strike\nYou can spend 2 ki points to cast Burning Hands.\nWater Whip\nYou can spend 2 ki points as an action to create a whip of water that shoves and pulls a creature to unbalance it. A creature that you can see that is within 30 feet of you must make a Dexterity saving throw. On a failed save, the creature takes 3d10 bludgeoning damage, plus an extra 1d10 bludgeoning damage for each additional ki point you spend, and you can either knock it prone or pull it up to 25 feet closer to you. On a successful save, the creature takes half as much damage, and you don't pull it or knock it prone.\nWave of Rolling Earth\nPrerequisite: 17th Level\nYou can spend 6 ki points to cast Wall of Stone.",
    "Eldritch Invocations": "FoldUnfold\nTable of Contents\n\nAgonizing Blast\nArmor of Shadows\nAscendant Step\nAspect of the Moon\nBeast Speech\nBeguiling Influence\nBewitching Whispers\nBond of the Talisman\nBook of Ancient Secrets\nChains of Carceri\nCloak of Flies\nDevil's Sight\nDreadful Word\nEldritch Mind\nEldritch Sight\nEldritch Smite\nEldritch Spear\nEyes of the Rune Keeper\nFar Scribe\nFiendish Vigor\nGaze of Two Minds\nGhostly Gaze\nGift of the Depths\nGift of the Ever-Living Ones\nGift of the Protectors\nGrasp of Hadar\nImproved Pact Weapon\nInvestment of the Chain Master\nLance of Lethargy\nLifedrinker\nMaddening Hex\nMask of Many Faces\nMaster of Myriad Forms\nMinions of Chaos\nMire the Mind\nMisty Visions\nOne with Shadows\nOtherworldly Leap\nProtection of the Talisman\nRebuke of the Talisman\nRelentless Hex\nRepelling Blast\nSculptor of Flesh\nShroud of Shadow\nSign of Ill Omen\nThief of Five Fates\nThirsting Blade\nTomb of Levistus\nTrickster's Escape\nUndying Servitude\nVisions of Distant Realms\nVoice of the Chain Master\nWhispers of the Grave\nWitch Sight\nUnearthed Arcana\nArcane Gunslinger\nBurning Hex\nCaiphon's Beacon\nChilling Hex\nChronicle of the Raven Queen\nClaw of Acamar\nCurse Bringer\nEldritch Armor\nGreen Lord's Gift\nKiss of Mephistopheles\nMace of Dispater\nMaddening Hex\nMoonbow\nPath of the Seeker\nRaven Queen's Blessing\nSeeker's Speech\nShroud of Ulban\nSuperior Pact Weapon\nUltimate Pact Weapon\n\n\nAgonizing Blast\nSource: Player's Handbook\nPrerequisite: eldritch blast cantrip\nWhen you cast eldritch blast, add your Charisma modifier to the damage it deals on a hit.\nArmor of Shadows\nSource: Player's Handbook\nYou can cast mage armor on yourself at will, without expending a spell slot or material components.\nAscendant Step\nSource: Player's Handbook\nPrerequisite: 9th level\nYou can cast levitate on yourself at will, without expending a spell slot or material components.\nAspect of the Moon\nSource: Xanathar's Guide to Everything\nPrerequisite: Pact of the Tome feature\nYou no longer need to sleep and can't be forced to sleep by any means. To gain the benefits of a long rest, you can spend all 8 hours doing light activity, such as reading your Book of Shadows and keeping watch.\nBeast Speech\nYou can cast speak with animals at will, without expending a spell slot.\nBeguiling Influence\nYou gain proficiency in the Deception and Persuasion skills.\nBewitching Whispers\nPrerequisite: 7th level\nYou can cast compulsion once using a warlock spell slot. You can't do so again until you finish a long rest.\nBond of the Talisman\nSource: Tasha's Cauldron of Everything\nPrerequisite: 12th level, Pact of the Talisman feature\nWhile someone else is wearing your talisman, you can use your action to teleport to the unoccupied space closest to them, provided the two of you are on the same plane of existence. The wearer of your talisman can do the same thing, using their action to teleport to you. The teleportation can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest.\nBook of Ancient Secrets\nPrerequisite: Pact of the Tome feature\nYou can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class's spell list (the two needn't be from the same list). The spells appear in the book and don't count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can't cast the spells except as rituals, unless you've learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag.\nOn your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell's level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it.\nChains of Carceri\nSource: Player's Handbook\nPrerequisite: 15th level, Pact of the Chain feature\nYou can cast hold monster at will – targeting a celestial, fiend, or elemental – without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again.\nCloak of Flies\nSource: Xanathar's Guide to Everything\nPrerequisite: 5th level\nAs a bonus action, you can surround yourself with a magical aura that looks like buzzing flies. The aura extends 5 feet from you in every direction, but not through total cover. It lasts until you're incapacitated or you dismiss it as a bonus action.\nThe aura grants you advantage on Charisma (Intimidation) checks but disadvantage on all other Charisma checks. Any other creature that starts its turn in the aura takes poison damage equal to your Charisma modifier (minimum of 0 damage).\nOnce you use this invocation, you can't use it again until you finish a short or long rest.\nDevil's Sight\nSource: Player's Handbook\nYou can see normally in darkness, both magical and nonmagical, to a distance of 120 feet.\nDreadful Word\nSource: Player's Handbook\nPrerequisite: 7th level\nYou can cast confusion once using a warlock spell slot. You can't do so again until you finish a long rest.\nEldritch Mind\nSource: Tasha's Cauldron of Everything\nYou have advantage on Constitution saving throws that you make to maintain your concentration on a spell.\nEldritch Sight\nSource: Player's Handbook\nYou can cast detect magic at will, without expending a spell slot or material components.\nEldritch Smite\nSource: Xanathar's Guide to Everything\nPrerequisite: 5th level, Pact of the Blade feature\nOnce per turn when you hit a creature with your pact weapon, you can expend a warlock spell slot to deal an extra 1d8 force damage to the target, plus another 1d8 per level of the spell slot, and you can knock the target prone if it is Huge or smaller.\nEldritch Spear\nSource: Player's Handbook\nPrerequisite: eldritch blast cantrip\nWhen you cast eldritch blast, its range is 300 feet.\nEyes of the Rune Keeper\nSource: Player's Handbook\nYou can read all writing.\nFar Scribe\nSource: Tasha's Cauldron of Everything\nPrerequisite: 5th level, Pact of the Tome feature\nA new page appears in your Book of Shadows. With your permission, a creature can use its action to write its name on that page, which can contain a number of names equal to your proficiency bonus.\nYou can cast the sending spell, targeting a creature whose name is on the page, without using a spell slot and without using material components. To do so, you must write the message on the page. The target hears the message in their mind, and if the target replies, their message appears on the page, rather than in your mind. The writing disappears after 1 minute.\nAs an action, you can magically erase a name on the page by touching it.\nFiendish Vigor\nSource: Player's Handbook\nYou can cast false life on yourself at will as a 1st-level spell, without expending a spell slot or material components.\nGaze of Two Minds\nSource: Player's Handbook\nYou can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature's senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings.\nGhostly Gaze\nSource: Xanathar's Guide to Everything\nPrerequisite: 7th level\nAs an action, you gain the ability to see through solid objects to a range of 30 feet. Within that range, you have darkvision if you don't already have it. This special sight lasts for 1 minute or until your concentration ends (as if you were concentrating on a spell). During that time, you perceive objects as ghostly, transparent images.\nOnce you use this invocation, you can't use it again until you finish a short or long rest.\nGift of the Depths\nSource: Xanathar's Guide to Everything\nPrerequisite: 5th level\nYou can breathe underwater, and you gain a swimming speed equal to your walking speed.\nYou can also cast water breathing without expending a spell slot. You regain the ability to do so when you finish a long rest.\nGift of the Ever-Living Ones\nSource: Xanathar's Guide to Everything\nPrerequisite: Pact of the Chain feature\nWhenever you regain hit points while your familiar is within 100 feet of you, treat any dice rolled to determine the hit points you regain as having rolled their maximum value for you.\nGift of the Protectors\nSource: Tasha's Cauldron of Everything\nPrerequisite: 9th level, Pact of the Tome feature\nA new page appears in your Book of Shadows. With your permission, a creature can use its action to write its name on that page, which can contain a number of names equal to your proficiency bonus.\nWhen any creature whose name is on the page is reduced to 0 hit points but not killed outright, the creature magically drops to 1 hit point instead. Once this magic is triggered, no creature can benefit from it until you finish a long rest.\nAs an action, you can magically erase a name on the page by touching it.\nGrasp of Hadar\nSource: Xanathar's Guide to Everything\nPrerequisite: eldritch blast cantrip\nOnce on each of your turns when you hit a creature with your eldritch blast, you can move that creature in a straight line 10 feet closer to yourself.\nImproved Pact Weapon\nSource: Xanathar's Guide to Everything\nPrerequisite: Pact of the Blade feature\nYou can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells.\nIn addition, the weapon gains a +1 bonus to its attack and damage rolls, unless it is a magic weapon that already has a bonus to those rolls.\nFinally, the weapon you conjure can be a shortbow, longbow, light crossbow, or heavy crossbow.\nInvestment of the Chain Master\nSource: Tasha's Cauldron of Everything\nPrerequisite: Pact of the Chain feature\nWhen you cast find familiar, you infuse the summoned familiar with a measure of your eldritch power, granting the creature the following benefits:\n\nThe familiar gains either a flying speed or a swimming speed (your choice) of 40 feet.\n\n\nAs a bonus action, you can command the familiar to take the Attack action.\n\n\nThe familiar's weapon attacks are considered magical for the purpose of overcoming immunity and resistance to nonmagical attacks.\n\n\nIf the familiar forces a creature to make a saving throw, it uses your spell save DC.\n\n\nWhen the familiar takes damage, you can use your reaction to grant it resistance against that damage.\n\nLance of Lethargy\nSource: Xanathar's Guide to Everything\nPrerequisite: eldritch blast cantrip\nOnce on each of your turns when you hit a creature with your eldritch blast, you can reduce that creature's speed by 10 feet until the end of your next turn.\nLifedrinker\nSource: Player's Handbook\nPrerequisite: 12th level, Pact of the Blade feature\nWhen you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum 1).\nMaddening Hex\nSource: Xanathar's Guide to Everything\nPrerequisite: 5th level, hex spell or a warlock feature that curses\nAs a bonus action, you cause a psychic disturbance around the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse and Sign of Ill Omen. When you do so, you deal psychic damage to the cursed target and each creature of your choice within 5 feet of it. The psychic damage equals your Charisma modifier (minimum of 1 damage). To use this invocation, you must be able to see the cursed target, and it must be within 30 feet of you.\nMask of Many Faces\nSource: Player's Handbook\nYou can cast disguise self at will, without expending a spell slot.\nMaster of Myriad Forms\nSource: Player's Handbook\nPrerequisite: 15th level\nYou can cast alter self at will, without expending a spell slot.\nMinions of Chaos\nSource: Player's Handbook\nPrerequisite: 9th level\nYou can cast conjure elemental once using a warlock spell slot. You can't do so again until you finish a long rest.\nMire the Mind\nSource: Player's Handbook\nPrerequisite: 5th level\nYou can cast slow once using a warlock spell slot. You can't do so again until you finish a long rest.\nMisty Visions\nSource: Player's Handbook\nYou can cast silent image at will, without expending a spell slot or material components.\nOne with Shadows\nSource: Player's Handbook\nPrerequisite: 5th level\nWhen you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction.\nOtherworldly Leap\nSource: Player's Handbook\nPrerequisite: 9th level\nYou can cast jump at will, without expending a spell slot.\nProtection of the Talisman\nSource: Tasha's Cauldron of Everything\nPrerequisite: 7th level, Pact of the Talisman feature\nWhen the wearer of your talisman fails a saving throw, they can add a d4 to the roll, potentially turning the save into a success. This benefit can be used a number of times equal to your proficiency bonus, and all expended uses are restored when you finish a long rest.\nRebuke of the Talisman\nSource: Tasha's Cauldron of Everything\nPrerequisite: Pact of the Talisman feature\nWhen the wearer of your talisman is hit by an attacker you can see within 30 feet of you, you can use your reaction to deal psychic damage to the attacker equal to your proficiency bonus and push it up to 10 feet away from the talisman's wearer.\nRelentless Hex\nSource: Xanathar's Guide to Everything\nPrerequisite: 7th level, hex spell or a warlock feature that curses\nYour curse creates a temporary bond between you and your target. As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see within 5 feet of the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse and Sign of Ill Omen. To teleport in this way, you must be able to see the cursed target.\nRepelling Blast\nSource: Player's Handbook\nPrerequisite: eldritch blast cantrip\nWhen you hit a creature with eldritch blast, you can push the creature up to 10 feet away from you in a straight line.\nSculptor of Flesh\nSource: Player's Handbook\nPrerequisite: 7th level\nYou can cast polymorph once using a warlock spell slot. You can't do so again until you finish a long rest.\nShroud of Shadow\nSource: Xanathar's Guide to Everything\nPrerequisite: 15th level\nYou can cast invisibility at will, without expending a spell slot.\nSign of Ill Omen\nSource: Player's Handbook\nPrerequisite: 5th level\nYou can cast bestow curse once using a warlock spell slot. You can't do so again until you finish a long rest.\nThief of Five Fates\nSource: Player's Handbook\nYou can cast bane once using a warlock spell slot. You can't do so again until you finish a long rest.\nThirsting Blade\nSource: Player's Handbook\nPrerequisite: 5th level, Pact of the Blade feature\nYou can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn.\nTomb of Levistus\nSource: Xanathar's Guide to Everything\nPrerequisite: 5th level\nAs a reaction when you take damage, you can entomb yourself in ice, which melts away at the end of your next turn. You gain 10 temporary hit points per warlock level, which take as much of the triggering damage as possible. Immediately after you take the damage, you gain vulnerability to fire damage, your speed is reduced to 0, and you are incapacitated. These effects, including any remaining temporary hit points, all end when the ice melts.\nOnce you use this invocation, you can't use it again until you finish a short or long rest.\nTrickster's Escape\nSource: Xanathar's Guide to Everything\nPrerequisite: 7th level\nYou can cast freedom of movement once on yourself without expending a spell slot. You regain the ability to do so when you finish a long rest.\nUndying Servitude\nSource: Tasha's Cauldron of Everything\nPrerequisite: 5th-level warlock\nYou can cast animate dead without using a spell slot. Once you do so, you can't cast it in this way again until you finish a long rest.\nVisions of Distant Realms\nSource: Player's Handbook\nPrerequisite: 15th level\nYou can cast arcane eye at will, without expending a spell slot.\nVoice of the Chain Master\nSource: Player's Handbook\nPrerequisite: Pact of the Chain feature\nYou can communicate telepathically with your familiar and perceive through your familiar's senses as long as you are on the same plane of existence. Additionally, while perceiving through your familiar's senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech.\nWhispers of the Grave\nSource: Player's Handbook\nPrerequisite: 9th level\nYou can cast speak with dead at will, without expending a spell slot.\nWitch Sight\nSource: Player's Handbook\nPrerequisite: 15th level\nYou can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight.\nUnearthed Arcana\nArcane Gunslinger\nSource: Unearthed Arcana 7 - Modern Magic\nPrerequisite: Pact of the Blade feature\nYou can create a pact weapon that is a sidearm or long arm, and you can transform a magical sidearm or long arm into your pact weapon.\nBurning Hex\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Hexblade patron\nAs a bonus action, you cause a target cursed by your Hexblade's Curse to take fire damage equal to your Charisma modifier (minimum of 1).\nCaiphon's Beacon\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Great Old One patron\nThe purple star Caiphon is the doom of inexperienced mariners. Those who use its deceptive light to guide their travels invariably come to ruin. You gain proficiency in the Deception and Stealth skills, and you have advantage on attack rolls against charmed creatures.\nChilling Hex\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Hexblade patron\nAs a bonus action, you cause frost to swirl around a target cursed by your Hexblade's Curse, dealing cold damage to each of your enemies within 5 feet of the target. The cold damage equals your Charisma modifier (minimum of 1).\nChronicle of the Raven Queen\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: Raven Queen patron, Pact of the Tome feature\nYou can place a corpse's hand or similar appendage on your Book of Shadows and ask one question aloud. After 1 minute, the answer appears written in blood in your book. The answer is provided by the dead creature's spirit to the best of its knowledge and is translated into a language of your choice. You must use this ability within 1 minute of a creature's death, and a given creature can only be asked one question in this manner.\nClaw of Acamar\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Great Old One patron, Pact of the Blade feature\nYou can create a black, lead flail using your Pact of the Blade feature. The flail's head is sculpted to resemble a pair of grasping tentacles. The weapon has the reach property. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 necrotic damage to the target per spell level, and you can reduce the creature's speed to 0 feet until the end of your next turn.\nCurse Bringer\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Hexblade patron, Pact of the Blade feature\nYou can create a greatsword forged from silver, with black runes etched into its blade, using your Pact of the Blade feature. If you reduce a target cursed by your Hexblade's Curse to 0 hit points with this sword, you can immediately change the target of the curse to a different creature. This change doesn't extend the curse's duration.\nWhen you hit a creature with this weapon, you can expend a spell slot to deal an additional 2d8 slashing damage to the target per spell level, and you can reduce the creature's speed to 0 feet until the end of your next turn.\nEldritch Armor\nSource: Unearthed Arcana 62 - Class Feature Variants\nPrerequisite: Pact of the Blade feature\nAs an action, you can touch a suit of armor that isn't being worn or carried by anyone and instantly don it, provided you aren't wearing armor already. You are proficient with this suit of armor until it's removed.\nGreen Lord's Gift\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Archfey patron\nThe Green Lord oversees a verdant realm of everlasting summer. Your soul is linked to his power. Whenever you regain hit points, you treat any dice rolled to determine the hit points you regain as having rolled their maximum value.\nKiss of Mephistopheles\nSource: Unearthed Arcana 40 - Revised Class Options\nPrerequisite: eldritch blast cantrip\nWhen you hit a creature with your eldritch blast, you can cast fireball as a bonus action using a warlock spell slot. The spell must be centered on the creature you hit with eldritch blast.\nMace of Dispater\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Fiend patron, Pact of the Blade feature\nWhen you create your pact weapon as a mace, it manifests as an iron mace forged in Dis, the second of the Nine Hells. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 force damage to the target per spell level, and you can knock the target prone if it is Huge or smaller.\nMaddening Hex\nSource: Unearthed Arcana 40 - Revised Class Options\nPrerequisite: 5th level\nAs a bonus action, you cause a psychic disturbance around the target cursed by your hex spell or by a warlock feature of yours, such as Hexblade's Curse and Sign of Ill Omen. When you do so, you deal psychic damage to the target and each creature of your choice within 5 feet of it. The psychic damage equals your Charisma modifier (minimum of 0 damage).\nMoonbow\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Archfey patron, Pact of the Blade feature\nYou can create a longbow using your Pact of the Blade feature. When you draw back its string and fire, it creates an arrow of white wood, which vanishes after 1 minute. You have advantage on attack rolls against lycanthropes with the bow. When you hit a creature with it, you can expend a spell slot to deal an additional 2d8 radiant damage to the target per spell level.\nPath of the Seeker\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Seeker patron\nThe Seeker bids you to travel in search of knowledge, and little can prevent you from waling this path. You ignore difficult terrain, have advantage on all checks to escape a grapple, manacles, or rope bindings, and advantage on saving throws against being paralyzed.\nRaven Queen's Blessing\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: Raven Queen patron, eldritch blast cantrip\nWhen you score a critical hit with your eldritch blast cantrip, pick yourself or an ally you can see within 30 feet of you. The chosen creature can immediately expend a Hit Die to regain hit points equal to the roll + the creature's Constitution modifier (minimum of 1 hit point).\nSeeker's Speech\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Seeker patron\nYour quest for knowledge allows you to master any spoken language. When you complete a long rest, you can pick two languages. You gain the ability to speak, read, and write the chosen languages until you finish your next long rest.\nShroud of Ulban\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: The Great Old One patron\nThe blue-white star Ulban maintains a fickle presence among the stars, fluttering into view only to herald a dire omen. As an action, you can turn invisible for 1 minute. If you attack, deal damage, or force a creature to make a saving throw, you become visible at the end of the current turn.\nSuperior Pact Weapon\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: 9th level, Pact of the Blade feature\nYou can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells.\nIn addition, the weapon counts as a magic weapon with a +2 bonus to its attack and damage rolls, unless it is already a magic weapon that you transformed into your pact weapon.\nUltimate Pact Weapon\nSource: Unearthed Arcana 29 - Warlock & Wizard\nPrerequisite: 15th level, Pact of the Blade feature\nYou can use any weapon you summon with your Pact of the Blade feature as a spellcasting focus for your warlock spells.\nIn addition, the weapon counts as a magic weapon with a +3 bonus to its attack and damage rolls, unless it is already a magic weapon that you transformed into your pact weapon."
}