{"Artificer": {"Forge Adept": {"Tool Proficiency": ["When you adopt this specialization at 3rd level, you gain proficiency with smith’s tools. If you already have this proficiency, you gain proficiency with one other type of artisan’s tools of your choice."], "Forge Adept Spells": ["Starting at 3rd level, you always have certain spells prepared after you reach particular levels in this class, as shown in the Forge Adept Spells table. These spells count as artificer spells for you, but they don’t count against the number of artificer spells you prepare."], "Battle Ready": ["Beginning at 3rd level, you’re skilled in fighting side-by-side with your companions on the field of battle. You gain proficiency with martial weapons. Additionally, when you attack with a magic weapon, you can use your Intelligence modifier, instead of Strength or Dexterity, for the attack and damage rolls."], "Ghall'Shaarat": ["At 3rd level, you learn to imbue a weapon with a fraction of your spirit. The Dhakaani daashors called this weapon the ghaal’shaarat, Goblin for “mighty blade.” Imbuing your ghaal’shaarat works like infusing an item, but does not count toward your maximum number of infused items. When you finish a long rest, you can touch a magic or nonmagical simple or martial melee weapon, which becomes your ghaal’shaarat.", "Once imbued, your ghaal’shaarat is a magic weapon that grants a +1 bonus to attack and damage rolls, unless the base weapon you imbued already grants a higher bonus. This bonus increases when you reach certain levels in this class, increasing to +2 at 8th level and +3 at 13th level. If the weapon you imbued has the thrown property, it returns to your hand immediately after it is used to make a ranged attack.", "Your ghaal’shaarat’s benefits remain until the weapon is destroyed or until you use this ability to imbue a new item with this power. Other creatures can’t benefit from your ghaal’shaarat’s powers, and to them, it functions as the unimbued weapon did."], "Extra Attack": ["Starting at 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn."], "Runes of War": ["At 9th level, you gain the ability to enhance the weapons of your squad, targeting the damage to the weakness of your enemies. As an action, you can activate an aura that extends from you in a 30-foot radius. The aura moves with you, centered on you, and lasts for 1 minute or until your concentration ends (as if you were casting a spell).", "When you activate this aura, choose one of the following damage types: acid, cold, fire, lightning, or thunder. Each creature of your choice in the aura deals an extra 1d4 damage of the chosen type when it hits with a weapon attack.", "You can use this feature a number of times equal to your Intelligence modifier (minimum of once), and you regain all expended uses after a long rest."], "Perfect Weapon": ["At 15th level, you learn how to imbue your ghaal’shaarat with additional power, and how to draw on it in time of need. The first time you attack with your ghaal’shaarat on your turn, you can transfer some or all of its bonus to your armor class, instead of using the bonus on any attacks that turn. For every 1 you reduce your attack and damage rolls by, you gain +1 to your AC. As long as you continue holding your ghaal’shaarat, the AC bonus remains in effect until the start of your next turn.", "Additionally, when you finish a long rest, you can select one of the following benefits. Until you finish your next long rest, you gain the selected benefit whenever you’re holding your ghaal’shaarat.", "\nYou have resistance to psychic damage, and you can’t be charmed or frightened.\n", "\nYou use your ghaal’shaarat to channel the elements. When you select this ability, select one of the following damage types: acid, cold, fire, lightning, or thunder. When you hit with your ghaal’shaarat, the target takes an extra 1d6 damage of the chosen type.\n"]}, "Mastermaker": {"Tools of Integration": ["At 3rd level, you gain proficiency with heavy armor and smith’s tools. If you already have this tool proficiency, you gain proficiency with one other type of artisan’s tools of your choice."], "Mastermaker Spells": {"Mastermaker Spells": []}, "Prosthesis Expertise": ["At 3rd level, whenever you finish a long rest, you can touch a nonmagical object and imbue it with your power, creating a permanent magical item that replaces a lost limb—a hand, arm, foot, leg, or similar body part. While the prosthetic is attached, it functions identically to the part it replaces. The wearer can detach or reattach it as an action, and it can’t be removed against the wearer’s will. It detaches if the wearer dies."], "Battlefist": ["At 3rd level you replace one of your arms with a battlefist, a magical prosthetic you created. Your battlefist is a simple melee weapon, and you can use it as a spellcasting focus for your artificer spells. While your battlefist is a magical weapon, it can be infused as if it were a nonmagical weapon.", "When you attack with your battlefist, you can use your Intelligence modifier instead of Strength for the attack roll. If you hit with it, you deal bludgeoning damage equal to 1d10 + your Strength or Intelligence modifier. At 9th level, the damage dealt by your battlefist increases to 2d10 + your Strength or Intelligence modifier.", "Additionally, you can choose one of the following weapon properties to add to your battlefist: finesse, thrown (range 20/60), or reach. When you finish a long rest, you can replace this property with a different weapon property from the list."], "Extra Attack": ["At 5th level, you can attack twice, rather than once, whenever you take the Attack action on your turn."], "Improved Battlefist": ["At 9th level, you have modified your battlefist in both mundane and magical ways. It gains the following benefits:", "\nWhen you infuse your battlefist, you can apply two infusions to it at a time. If both infusions grant bonuses to your attack rolls or armor class, you gain only the greater bonus.\nYour battlefist is also a shield, increasing your armor class by 2. You can wield it as a weapon even if you are using it as a shield. You can infuse it as if it were both a simple melee weapon and a shield.\nThe maximum number of items you can infuse at once increases by 1, but the extra infusion must be applied to your battlefist.\n"], "Construct Apotheosis": ["At 15th level you have modified your form, becoming nearly impervious to the weaknesses of flesh. You gain the following benefits:", "\nYou gain resistance to poison damage and psychic damage, and you are immune to the poisoned condition.\nIf you are affected by a spell or magical effect, you can choose to consider yourself a construct instead of your other creature types.\nYou can cast the Antilife Shell and Investiture of Stone spells without expending a spell slot, without preparing the spell, and without material components, provided you use your battlefist as the spellcasting focus. Once you cast either spell with this feature, you can’t cast that spell with it again until you finish a long rest.\n"]}, "Maverick": {"Arcane Breakthroughs": ["Starting at 3rd level, you gain amazing insights into spell effects beyond the reach of most artificers. Choose one of the following classes: bard, cleric, druid, paladin, ranger, sorcerer, warlock, or wizard. This class’s spells become part of your Breakthrough spell list. You can choose an additional class and add its spells to your Breakthrough spell list at 5th, 9th, 13th, and 17th levels.", "When you change your list of prepared artificer spells after a long rest, you can prepare an additional 1st-level spell. This spell must be from your Breakthrough spell list. When you reach certain levels in this class, you increase the number of Breakthrough spells that you can prepare. You can prepare an additional 2nd-level spell at 5th level, an additional 3rd-level spell at 9th level, an additional 4th-level spell at 13th level, and an additional 5th-level spell at 17th level. These prepared spells don’t count against the number of artificer spells you prepare.", "When you cast a spell you’ve prepared using this feature, it’s considered to be an artificer spell for you, and Intelligence is your spellcasting ability for it. When you swap a prepared Breakthrough spell for a new spell, you lose any ongoing benefits from having cast it (such as a steed summoned by find steed)."], "Cantrip Specialist": ["You excel at producing minor magical effects—and at abandoning your current projects to pursue new ideas. Starting at 3rd level you gain the following benefits:", "\nYou know one additional cantrip beyond what’s normally allowed for an artificer of your level.\n", "\nWhen you finish a short rest (instead of when you gain a level in this class), you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list or your Breakthrough spell list. This cantrip is considered an artificer cantrip for you.\n"], "Cantrip Savant": ["Starting at 5th level, you continue to develop your talent for the simplest spells. You gain the following benefits:", "\nWhen casting an artificer cantrip, you gain a +1 bonus to attack rolls and to your artificer spell save DC unless your spellcasting focus grants a higher bonus. This bonus increases when you reach certain levels in this class, increasing to +2 at 9th level and +3 at 15th level.\n", "\nAs an action, you can replace an artificer cantrip you know with a different cantrip from the artificer spell list or your Breakthrough spell list. Once you use this feature, you can’t use it again until you finish a long rest.\n"], "Superior Breakthoughs": ["Starting at 9th level, when you cast one of the spells you prepared with Arcane Breakthroughs, you can do so as if the spell was cast using a spell slot two levels higher than the spell slot you expend.\nYou can use this feature a number of times equal to your Intelligence modifier (minimum of 1). You regain all expended uses after you finish a long rest."], "Work in Progress": ["Starting at 9th level, you can ready half-formed projects for easy completion when needed. As an action, you can replace any prepared artificer spell with any other spell from the artificer spell list, which then counts as a prepared spell for you.", "Once you use this feature, you can’t use it again until you finish a short or a long rest."], "Final Breakthrough": ["At 15th level, you gain one additional spell slot of each spell level you can prepare. These spell slots can only be used to cast the bonus spells granted by your Arcane Breakthroughs. As you gain levels in this class and are able to prepare 5th-level artificer spells, you gain an additional spell slot of that level."]}}, "Barbarian": {"Path of the Juggernaut": {"Thunderous Blows": ["Starting when you choose this path at 3rd level, your rage instills you with the strength to batter around your foes, making any battlefield your domain. Once per turn while raging, when you damage a creature with a melee attack, you can force the target to make a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier). On a failure, you push the target 5 feet away from you, and you can choose to immediately move 5 feet into the target’s previous position."], "Stance of the Mountain": ["You harness your fury to anchor your feet to the earth, shrugging off the blows of those who wish to topple you. Upon choosing this path at 3rd level, you cannot be knocked prone while raging unless you become unconscious."], "Demolishing Might": ["Beginning at 6th level, you can muster destructive force with your assault, shaking the core of even the strongest structures. All of your melee attacks gain the siege property (your attacks deal double damage to objects and structures). Your melee attacks against creatures of the construct type deal an additional 1d8 weapon damage."], "Overwhelming Cleave": ["Upon reaching 10th level, you wade into armies of foes, great swings of your weapon striking any who threaten you. When you make a weapon attack while raging, you can make another attack as a bonus action with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon."], "Unstoppable": ["Starting at 14th level, you can choose to become unstoppable when you enter a rage. If you do so, for the duration of the rage your speed cannot be reduced, and you are immune to the frightened, paralyzed, and stunned conditions. If you are frightened, paralyzed, or stunned, you can still take your bonus action to enter your rage and suspend the effects for the duration of the rage. When your rage ends, you suffer one level of exhaustion."]}, "Path of the Juggernaut Reborn": {"Thunderous Blows": ["Starting when you choose this path at 3rd level, your rage instills you with the strength to shove and smash your way through your foes, making any battlefield your domain. When you hit a creature with a melee attack while you’re raging, you can push that creature up to 5 feet away from you in a direction of your choice. A creature that is Huge or larger makes a Strength saving throw with a DC equal to 8 + your proficiency bonus + your Strength modifier. On a success, the creature is not pushed.", "Starting at 10th level, you can push a creature up to 10 feet when you hit it with a melee attack while you're raging."], "Spirit of the Mountain": ["At 3rd level, you harness your fury to anchor your feet to the ground, becoming a bulwark of strength. While you are raging, you can’t be knocked prone or moved along the ground against your will."], "Demolishing Might": ["Starting at 6th level, your melee weapon attacks deal an extra 1d8 damage to constructs, and deal double damage to objects and structures."], "Resolute Stance": ["Also at 6th level, you can temporarily refocus your combat ability to make yourself a bulwark of defense. At the start of your turn (no action required), you can assume a defensive stance that lasts until the start of your next turn. While in this stance, you can’t be grappled, attack rolls against you have disadvantage, and your weapon attacks are made with disadvantage."], "Hurricane Strike": ["Starting at 10th level, your blows can hurl foes through the air and into the attacks of your allies. As a reaction when you push a creature at least 5 feet, you can then leap into an unoccupied space next to the creature. If you do so, the creature must succeed on a Strength saving throw with a DC equal to 8 + your proficiency bonus + your Strength modifier or be knocked prone. This leap costs no movement and does not provoke opportunity attacks.", "Additionally, whenever you push a creature into a space within 5 feet of one of your allies, the ally can use its reaction to make a melee weapon attack against that creature."], "Unstoppable": ["At 14th level, your fury in battle makes you unstoppable. While you’re raging, your speed cannot be reduced, and you are immune to the frightened, paralyzed, prone, and stunned conditions. If you are frightened, paralyzed, or stunned, you can still use a bonus action to enter a rage (even if you can’t otherwise take actions). You aren’t affected by any of these conditions while you’re raging."]}, "Path of the Depths": {"Gift of the Drowned Ones": ["At 3rd level when you adopt this path, you gain a swimming speed equal to your walking speed and gain the ability to breathe underwater."], "Dredge Line": ["Starting when you choose this path at 3rd level, you manifest an extra appendage when you enter your rage. This weapon can appear as a kraken tentacle, a giant anchor, preternatural jaws, or something else based on your history.", "As a bonus action, you can use this appendage to strike at one creature of your choice that you can see within 15 feet. The target must succeed on a Strength saving throw (DC equal to 8 + your proficiency bonus + your Strength modifier) or be pulled up to 10 feet in a straight line towards you."], "Ghostwater Dive": ["Beginning at 6th level, you can burst into water then materialize somewhere else as an action. You magically teleport along with any equipment you are wearing or carrying, up to 30 feet to an unoccupied space you can see. Before or after teleporting, you can make one attack, as part of your action. Moving in this way does not provoke opportunity attacks."], "Manifestations of the Deep": ["At 10th level, you can manifest additional adaptations of the deep. Select one of the below adaptations you manifest, during a long rest you may replace your chosen manifestation with a new option from this list:", "\nEyes of the Deep: You gain the ability to use echolocation. When you do so, you cast the True Seeing spell, without using a spell slot or material components. After you cast a spell in this way, you can’t use this feature again until you finish a short or long rest.\n", "\nArms of the Deep: While raging, you now manifest two magical appendages, which may be tentacles, chains and anchors, animated rigging, or another grasping arm of your choice. When you use your dredge line ability, you can attempt a grapple with each of your appendages.\n", "\nHeart of the Deep: Now on your turn, you can use a bonus action to gain temporary hit points equal to 1d12 + your barbarian level. Once you use this feature, you must finish a short or long rest before you can use it again.\n", "\nSoul of the Deep: You are now immune to all effects that would cause you to be charmed or frightened.\n", "\nArmor of the Deep: Your skin hardens, increasing your Armor Class by 1.\n"], "Depth Charge": ["At 14th level, when you use your ghostwater dive ability, you can choose to appear with a wave of tidal force. When you appear all creatures within 10 feet of you must make a Strength saving throw. On a failed save a creature takes 3d6 force damage and is knocked prone. On a successful save, a creature takes half damage and is not knocked prone."]}}, "Bard": {"College of the Dirge Singer": {"Broad Inspiration": ["When you join the College of Dirge Singers at 3rd level, you learn to strengthen the hearts of your troops and stir them to greatness. You learn the Guidance cantrip, which is considered a bard spell for you, but doesn’t count against your number of cantrips known.", "Additionally, as a bonus action, you can expend one use of your Bardic Inspiration to inspire multiple allies. When you do so, choose two creatures within 60 feet of you that can hear you. Each creature gains one Bardic Inspiration die.", "Your Bardic Inspiration die does not change at 5th level, but remains a d6; it becomes a d8 at 10th level, and a d10 at 15th level."], "Keeper of History": ["Also at 3rd level, you gain proficiency in either History or Performance. If you are already proficient in both of these skills, you gain proficiency in one of the following skills of your choice: Arcana, Intimidation, or Persuasion.", "In addition, choose either History or Performance. Your proficiency bonus is doubled for any ability check you make that uses that skill."], "Commanding Voice": ["Starting at 6th level, you excel at inspiring and directing soldiers in battle. When a creature that has a Bardic Inspiration die from you takes the Attack action on its turn, you can use your reaction to allow it an additional weapon attack. The creature rolls the Bardic Inspiration die, adding the number rolled to its weapon damage roll."], "Master Commander": ["Starting at 14th level, you unflaggingly maintain the spirits and discipline of your unit. During your turn, you can use Countercharm as a bonus action. When you start a Countercharm performance, if any creature that gains its benefit is currently charmed or frightened, it can immediately make another saving throw against the effect that imposed the condition.", "In addition, when a creature that gains the benefit of your Countercharm performance makes an ability check or saving throw, it can roll a d4 and add the number rolled to the ability check or saving throw."]}, "College of the Maestro": {"Battle Muse": ["When you join the College of the Maestro at 3rd level, you gain one additional use of your Bardic Inspiration feature.", "This feature grants you another additional use of Bardic Inspiration at 6th level, and again at 14th level."], "Symphony of Conflict": ["You've been trained in the bardic art of magically manipulating the sounds of combat into a concert of powerful melodies that can alter the very battlefield around you.", "When you select this bardic school at 3rd level, you learn 2 conducting techniques of your choice, which are detailed under \"Conducting Techniques\" below. All techniques require at least one free hand, baton, or wand to utilize. For these techniques to function, you must be able to see your target, and they must be able to hear you.", "You learn 1 additional conducting technique of your choice at 6th and 14th level. Each time you learn a new technique, you can also replace one technique you know with a different one."], "Frenetic Crescendo": ["At 6th level, you can harness the beat of battle, whipping it into a frenzy of drums, chants, and glory. You can use your action to expend any number of uses of your Bardic Inspiration feature. For each expended use, you can immediately grant a Bardic Inspiration die to a creature other than yourself within 60 feet that you can see. A creature can have only one Bardic Inspiration die at a time.", "Once you use this feature, you must finish a long rest before you can use it again."], "Virtuoso of Captivation": ["Upon reaching 14th level, you can begin conducting a mystical symphony as an action, distracting and capturing the minds of nearby creatures. For up to 10 minutes, any number of creatures you choose within 60 feet who can hear you have disadvantage on any saving throws against being charmed and against magical sleep.", "In addition, affected targets have disadvantage on Wisdom (Perception) rolls that rely on sight or sound to detect targets other than you.", "In combat, you must spend your action each turn to continue the performance or the effect ends. Once you use Virtuoso of Captivation, you must finish a short or long rest before you can use it again.", ""]}, "College of Tragedy": {"Poetry in Misery": ["When you join the College of Tragedy at 3rd level, you learn to harness the beauty in failure, finding inspiration in even the direst twists of fate. Whenever you or an ally within 30 feet of you rolls a 1 on the d20 for an attack roll, an ability check, or a saving throw, you can use your reaction to soliloquize and regain one expended use of your Bardic Inspiration feature."], "Sorrowful Fate": ["Starting at 3rd level, you exploit a foe’s peril to instill deep feelings of sorrow and doom. When you or an ally you can see forces a creature to make a saving throw, you can expend one use of your Bardic Inspiration to change the type of saving throw to a Charisma save instead.", "If the target fails this save, roll a Bardic Inspiration die. The target takes psychic damage equal to the result, and is plagued with regret for 1 minute. If the target is reduced to 0 hit points during this time and can speak, they are magically compelled to utter darkly poetic final words before succumbing to their injuries.", "Once you use this feature, you can’t use it again until you finish a short or long rest."], "Tale of Hubris": ["At 6th level, you learn to weave a magical narrative that draws out the fatal arrogance of your foes. When a creature scores a critical hit against you or an ally within 60 feet of you that you can see, you can use your reaction and expend one use of your Bardic Inspiration to target the attacking creature and evoke the story of their downfall. For 1 minute or until the target suffers a critical hit, any weapon attack against the target scores a critical hit on a roll of 18–20.", "At 14th level, the critical hit range of this feature increases to 17–20."], "Unstoppable": ["Also at 6th level, your words can twist the power of fate to create triumph from the promise of future despair. When you make an attack roll or a saving throw, you can gain a +10 bonus to the roll, but the next attack roll or saving throw you make takes a −10 penalty. If not used, this penalty disappears when you finish a short or long rest.", "You can’t use this feature again until you finish a short or long rest, or until you are reduced to 0 hit points."], "Nimbus of Pathos": ["Upon reaching 14th level, you can touch a willing creature as an action and empower it with tragic heroism. For 1 minute, the creature is surrounded by mournful music and ghostly singing, granting it the following benefits and drawbacks:", "\nThe creature has a +4 bonus to AC.\nIt has advantage on attack rolls and saving throws.\nWhen the creature hits a target with a weapon attack or spell attack, that target takes an extra 1d10 radiant damage.\nAny weapon attack against the creature scores a critical hit on a roll of 18–20.\n", "When this effect ends, the creature immediately drops to 0 hit points and is dying. Once you use this feature, you can’t use it again until you finish a long rest."]}}, "Cleric": {"Beauty Domain": {"Beauty's Refuge": ["Starting at 1st level, your mere presence is enough to inspire hope and determination in others. When you complete a short or long rest, up to 12 allies of your choice gain temporary hit points equal to your Charisma modifier (minimum 1)."], "Rebuke the Defiler": ["When you select this domain at 1st level, you gain the ability to rebuke those who lash out at you in violence.", "As a reaction when a creature you can see within 30 feet of you inflicts damage, you force that creature to make a Wisdom save. On a failed saving throw, it takes psychic damage equal to the damage dealt. On a successful save, it takes half that damage.", "If the creature made multiple attacks, select one attack to determine the damage dealt. If the creature used one or more effects that damaged multiple targets, choose the damage take by one of those targets from one of the effects.", "Once you use this feature, you can't use it again until you complete a short or long rest."], "Channel Divinity: Beauty's Truce": ["Starting at 2nd level, you can use your Channel Divinity to quell the flame of violence.", "As an action, you force all creatures within 100 feet of you to make Charisma saving throws. Each creature that fails this save is charmed by every other creature that also failed the saving throw. This benefit lasts for one hour. While charmed by this ability, creatures consider all other creatures charmed by it to be their allies. They fight to defend them from attackers.", "While this ability persists, absent any threat, creatures charmed by it will rest, talk among themselves, share stories of their lives, create a communal feast using food and drink they carry, and generally act as if they are old friends, long separated and brought together again for a joyous reunion."], "Superior Refuge": ["Starting at 6th level, the temporary hit points granted by your Beauty's Refuge ability increase to 5 + your Charisma modifier (minimum 1)."], "Potent Cantrip": ["Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."], "Soul of Beauty": ["Starting at 17th level, you become an avatar of unearthly beauty. Your enemies attack with uncertainty, fearful of damaging the wondrous being they behold, while your magic draws upon your presence to augment its power.", "As a reaction, you can impose a penalty on a creature's attacks against you or on its saving throws against your spells and abilities. This benefit lasts until the end of the current turn The penalty equals your Charisma modifier (minimum 1)."]}, "Blood Domain": {"Bonus Proficiency": ["At 1st level, you gain proficiency with martial weapons."], "Bloodletting Focus": ["From 1st level, your divine magics draw the blood from inflicted wounds, worsening the agony of your nearby foes. When you use a spell of 1st level or higher to inflict damage to any creatures that have blood, those creatures suffer additional necrotic damage equal to 2 + the spell’s level."], "Channel Divinity: Blood Puppet": ["Starting at 2nd level, you can use your Channel Divinity to briefly control a creature’s actions against their will.", "As an action, you target a Large or smaller creature that has blood within 60 feet of you. That creature must succeed on a Constitution saving throw against your spell save DC or immediately move up to half of their movement in any direction of your choice and make a single weapon attack against a creature of your choice within range. Dead or unconscious creatures automatically fail their saving throw. At 8th level, you can target a Huge or smaller creature."], "Channel Divinity: Crimson Bond": ["Starting at 6th level, you can use your Channel Divinity to focus on a sample of blood from a creature that is at least 2 ounces, and that has been spilt no longer than a week ago.", "As an action, you can focus on the blood of the creature to form a bond and gain information about their current circumstances. You know their approximate distance and direction from you, as well as their general state of health, as long as they are within 10 miles of you. You can maintain this effect as though you were concentrating on a spell for up to 1 hour.", "During your bond, you can spend an action to attempt to connect with the bonded creature’s senses. The target makes a Constitution saving throw against your spell save DC. If they succeed, the connection is resisted, ending the bond. You suffer 2d6 necrotic damage. Upon a failed saving throw, you can choose to either see through the eyes of or hear through their ears of the target for a number of rounds equal to your Wisdom modifier (minimum of 1). During this time, you are blind or deaf (respectively) with regard to your own senses.", "Once this connection ends, the Crimson Bond is lost."], "Sanguine Recall": ["At 8th level, you can sacrifice a portion of your own vitality to recover expended spell slots. As an action, you recover spell slots that have a combined level equal to or less than half of your cleric level (rounded up), and none of the slots can be 6th level or higher. You immediately suffer 1d6 necrotic damage per spell slot level recovered. You can’t use this feature again until you finish a long rest.", "For example, if you are an 8th-level cleric, you can recover up to four levels of spell slots. You can recover a single 4th-level spell slot, two 2nd-level spell slots, a 3rd-level spell slot and a 1st level spell slot, or four 1st-level spell slots. You then suffer 4d6 damage."], "Vascular Corruption Aura": ["At 17th level, as an action, you can emit a powerful aura that extends 30 feet out from you. This aura pulses necrotic energy through the veins of nearby foes, causing them to burst and bleed.", "For 1 minute, any enemy creatures with blood that begin their turn within the aura or enter it for the first time on their turn immediately suffer 2d6 necrotic damage. Any enemy creature with blood that would regain hit points while within the aura only regains half of the intended number of hit points (rounded up).", "Once you use this feature, you can’t use it again until you finish a long rest."]}, "Blood Domain Reborn": {"Domain Spells": ["You gain domain spells at the cleric levels listen in the Blood Domain Spells table."], "Bonus Proficiency": ["When you choose this domain at 1st level, you gain proficiency with martial weapons."], "Bloodletting Focus": ["Starting at 1st level, your divine magic draws the blood from magically inflicted wounds, worsening the agony of your foes. When you cast a damage-dealing spell of 1st level or higher whose duration is instantaneous, any creature with blood that takes damage from the spell takes extra necrotic damage equal to 2 + the spell’s level."], "Channel Divinity: Crimson Bond": ["Starting at 2nd level, you can use your Channel Divinity to form a supernatural bond with a creature you can see, or with a creature for which you possess a blood sample. This bond lasts for 1 hour or until your concentration is broken (as if concentrating on a spell).", "While the bond is in effect, you can use an action to learn the target’s approximate distance and direction from you, as well as its current hit points and any conditions affecting it, as long as the target is within 10 miles of you. Alternatively, you can use your action to attempt to connect with the target’s senses. You take 2d6 necrotic damage and the target makes a Constitution saving throw against your spell save DC. On a successful save, the bond ends. On a failure, you can choose to either see or hear through the target’s senses for a number of minutes equal to your Wisdom modifier (minimum 1 minute). During this time, you are blinded or deafened (respectively) with regard to your own senses. When the connection ends, the bond is lost.", "Regardless of the outcome, the target feels a wave of unease pass over it when it makes this save."], "Channel Divinity: Blood Puppet": ["Starting at 6th level, you can use your Channel Divinity to briefly control a creature’s actions — whether that creature is living or dead. As an action, you target a Large or smaller creature or corpse within 60 feet of you that has blood. A creature you target must succeed on a Wisdom saving throw against your spell save DC or become charmed by you. An unconscious creature automatically fails its saving throw, and isn’t incapacitated while you control its actions. A corpse targeted by this effect gains a semblance of life that you control.", "On the affected creature or animated corpse’s turn, you can command it (no action required) to move up to half its speed and use its action to do one of the following:", "\nInteract with an object\nMake a single attack\nDo nothing\n", "An animated corpse or an unconscious creature takes its turn immediately after yours, but can’t move or take actions unless you command it to do so. Its statistics are the same as when it was alive or conscious.", "An affected living creature makes a new saving throw at the end of each of its turns, ending the effect on itself on a success. For any target, your control lasts for 1 minute or until your concentration is broken (as if concentrating on a spell).", "At 17th level, you can use this feature to target a Huge or smaller creature or corpse."], "Sanguine Recall": ["At 6th level, you can sacrifice a portion of your own vitality to recover expended spell slots as an action. The spell slots can have a combined level equal to or less than half your cleric level (rounded up), and none of the slots can be 6th level or higher. You take 1d8 necrotic damage for each spell slot level recovered, which can’t be reduced in any way. You can’t use this feature again until you finish a long rest.", "For example, if you’re an 8th-level cleric, you can recover up to four levels of spell slots — a single 4th-level slot, two 2nd-level slots, a 3rd-level slot and a 1st-level slot, or four 1st-level slots. You then take 4d8 necrotic damage."], "Divine Strike": ["At 8th level, you gain the ability to cause the physical wounds you deal out to bleed profusely. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 necrotic damage to the target. When you reach 14th level, the extra damage increases to 2d8."], "Vascular Corruption Aura": ["At 17th level, you can use your action to emit a deathly aura of necrotic energy that causes the veins of nearby foes to burst and bleed. For 1 minute, any hostile creature with blood that moves within 30 feet of you for the first time on a turn or starts its turn there takes 3d6 necrotic damage. If a hostile creature with blood regains hit points while in the aura, it regains only half as many hit points as expected.", "Once you use this feature, you can’t use it again until you finish a long rest."]}, "Mind Domain": {"Flash of Insight": ["Starting at 1st level, you can summon power from a well of mental energy at your core. When you make an ability check, you can choose to reroll it after you see the result, but before you know if it succeeds or fails. You get a bonus to this reroll equal to half of your cleric level (minimum of 1).", "You can use this feature twice. You regain expended uses when you finish a short or long rest."], "Psychic Force": ["Also at 1st level, you learn to buffet your foes with mental power. When you cast a cleric spell or cantrip that inflicts radiant damage, you can choose to have it inflict psychic damage instead."], "Channel Divinity: Psychic Feedback": ["Beginning at 2nd level, you can use your Channel Divinity to disrupt a foe’s mind. When a creature within 30 feet of you has to make a Wisdom saving throw, you can use your reaction to impose disadvantage on it using your Channel Divinity. You must use this feature before you know the outcome of the roll.", "If the spell or effect that caused the Wisdom saving throw is not created by a spell you cast, you can also choose to deal psychic damage to the target, equal to half your cleric level, immediately before the target makes its saving throw."], "Gestalt Anchor": ["Beginning at 6th level, your mental power increases, settling the minds of those around you with your mere presence. Whenever you or a friendly creature within 10 feet of you must make an Intelligence, Wisdom, or Charisma saving throw, the creature gains a +2 bonus to the saving throw. You must be conscious to grant this bonus."], "Potent Spellcasting": ["Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."], "Bend Reality": ["Starting at 17th level, when you see an ally within 30 feet of you fail a saving throw, you can replace the roll with a 20, potentially changing the outcome. Once you use this feature, you can’t use it again until you finish a short or long rest."]}, "Moon Domain": {"Domain Spells": ["You gain domain spells at the cleric levels listen in the Moon Domain Spells table."], "Clarity of Catha": ["When you choose this domain at 1st level, you learn to shine light upon the mind’s most dire moments, shielding those you protect. When a creature within 30 feet of you that you can see makes a Wisdom saving throw, you can use your reaction to grant that creature advantage on the save.", "You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest."], "Channel Divinity: Blessing of the Full Moon": ["Starting at 2nd level, you can use your Channel Divinity to infuse your allies with bestial power. As an action, you instill a willing creature of your choice within 30 feet of you that you can see with one of the following blessings of your choice:", "Blessing of the Watchful Moon. For 1 hour, the blessed creature’s speed increases by 10 feet, and it has advantage on Wisdom (Perception or Survival) checks involving smell or made to track a creature.", "Blessing of the Blood-Drenched Moon. For 10 minutes, the blessed creature has advantage on attack rolls against a target if at least one of the blessed creature’s allies is within 5 feet of the target and the ally isn’t incapacitated."], "Channel Divinity: Mind of Two Moons": ["Starting at 6th level, you can use your Channel Divinity to invoke the twofold arcana of Exandria’s moons. By expending one use of Channel Divinity, you can cast a second concentration spell while already concentrating on a first spell, as long as both spells are on your list of Moon Domain spells. If you need to make a Constitution saving throw to maintain your concentration on both spells, you make the save with disadvantage. On a failure, you lose concentration on both spells."], "Empowered Cantrips": ["Starting at 8th level, your cleric cantrips deal extra damage equal to your Wisdom modifier (minimum of 1)."], "Eclipse of Ill Omen": ["At 17th level, you can call upon the vermillion moon Ruidus to flare in the sky above you, eclipsing all other light. Its power surrounds you even where the sky can’t be seen, and even on other planes. As a bonus action, you can manifest an area of reddish, dim light in a 60-foot radius around you. In addition to the normal effects of dim light, creatures in the area make saving throws with disadvantage. When you create this eclipse, you can choose any number of creatures that are unaffected by it.", "This eclipse lasts while you concentrate (as if concentrating on a spell) for up to 1 minute. Concentrating on this feature counts as concentrating on a Moon Domain spell for the purpose of your Mind of Two Moons feature.", "Additionally, once per turn when you deal radiant damage to any creatures in this area of dim light, you can curse one of those creatures until the eclipse ends (no action required). A creature cursed in this way has its speed halved and can’t regain hit points.", "Once you use this feature, you can’t use it again until you finish a long rest."]}}, "Druid": {"Circle of the Blighted": {"Defile Ground": ["Starting at 2nd level when you choose this circle, you can use a bonus action to corrupt a patch of land or an area of water in a 10-foot radius centered on a point within 60 feet of you. This corruption lasts for 1 minute. The corrupted area is difficult terrain for creatures that are hostile to you. Additionally, when a creature in the area takes damage from an attack or spell for the first time on a turn, it takes an extra 1d4 necrotic damage. You can move this patch of corruption up to 30 feet as a bonus action. Flying creatures are unaffected by the corruption.", "Starting at 10th level, the area of your defiled ground increases to a 20-foot radius. Additionally, the extra damage dealt by your defiled ground increases to 1d6 when you reach 10th level in this class, and 1d8 at 14th level.", "Once you use this feature, you can’t use it again until you finish a short or long rest."], "Blighted Shape": ["Also at 2nd level, your physical form begins to show effects of the corruption you wield, tracing blackened veins across your skin, producing gnarled, bony protrusions, or other eerie phenomena. You gain proficiency in the Charisma (Intimidation) skill.", "Additionally, while you are transformed by you Wild Shape feature, you gain a +2 bonus to AC as gnarled spines protrude from your body. Your beast form also gains darkvision with a radius of 60 feet, or an additional 60 feet of darkvision if it already has that sense."], "Call of the Shadowseeds": ["At 6th level, you learn to summon the feral children of the forest from the life force of your enemies. When a creature that is not undead or a construct takes damage within the area of your Defile Ground feature, you can use your reaction to summon a blighted sapling in an unoccupied space within 5 feet of the creature. You can direct the sapling to make an attack against any creature within 5 feet of it as a part of this reaction. The sapling then acts on your initiative, obeying your verbal commands.", "The blighted sapling remains in your service until it’s reduced to 0 hit points, until the end of your next long rest, or until you summon another sapling, at which point it crumbles into foul-smelling mulch. You can use this feature a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest.", "The sapling uses the statistics below. Its features scale based on your level and proficiency bonus (PB)."], "Foul Conjuration": ["Starting at 10th level, the creatures you conjure are malformed and bloated with toxins. Any beast, fey, or plant (including your blighted sapling) summoned or created by your spells or class features gains the following traits:", "\nBlighted Resilience. The creature has immunity to necrotic and poison damage and to the poisoned condition.\nToxic Demise. When the creature is reduced to 0 hit points, it explodes in a burst of toxic mulch or fetid viscera. Each creature within 5 feet of the exploding creature must succeed on a Constitution saving throw against your spell save DC or take necrotic damage based on the creature’s challenge rating (see the table below). As an action, you can also cause a summoned creature to explode, immediately killing it.\n"], "Incarnation of Corruption": ["At 14th level, your physical form begins to take on the tainted traits of the land you are bonded to. Your skin grows ashen, and your eyes darken or turn completely white. Spines and jagged spurs emerge from your body, granting you resistance to necrotic damage and a +2 bonus to AC.", "Additionally, whenever you start your turn within the radius of the corruption created by your Defile Ground feature, you can use a bonus action to gain temporary hit points equal to your proficiency bonus."]}, "Circle of the Forged": {"Circle Forms": ["The rites of your circle grant you the ability to transform into more dangerous animal forms. Starting at 2nd level, you can use your Wild Shape to transform into a beast with a challenge rating as high as 1 (you ignore the Max. CR column of the Beast Shapes table, but must abide by the other limitations there).", "Starting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down."], "Skin of Steel": ["Starting at 2nd level, while you are transformed by Wild Shape, you gain the following benefits:", "\nYou gain a +2 bonus to Armor Class.\n", "\nYou have advantage on saving throws against being poisoned, and you have resistance to poison damage.\n", "\nYou don't need to eat, drink, or breathe.\n", "\nYou are immune to disease.\n", "\nYou don't need to sleep, and magic can't put you to sleep.\n", "While in beast form, your body is made from the same materials as a warforged; your muscles are rootlike tendrils protected by armored plates. It's obvious to an observer that you are not a normal animal."], "Elemental Fury": ["Starting at 6th level, you gain the ability to imbue your attacks with elemental damage—charging your claws with electricity or unleashing flames from your fangs. When you use Wild Shape, choose one of the following damage types: acid, cold, fire, or lightning. While in your beast form, the first time you hit a creature with a melee attack on your turn, you can expend one spell slot to deal extra damage of that type to the target, in addition to the normal damage of the attack. The extra damage is 1d6 per level of the spell slot expended, to a maximum of 5d6.", "When you use this ability on a creature, your attack has an additional effect, determined by which damage type you selected when you used Wild Shape. If a creature is affected by this ability again in subsequent rounds, the effects do not stack, and the new duration replaces the old.", "Acid. The target must make a Constitution saving throw against your druid spell save DC. On a failed save, its AC is reduced for one minute by an amount equal to half your Wisdom modifier (minimum of 1). At the start of each of its turns for the next minute, the target can make another Constitution saving throw. On a successful save, the effect ends.", "Cold. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, their movement speed is reduced to 0 and they have disadvantage on Strength and Dexterity checks. On a successful save, the effect ends.", "Fire. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, it takes fire damage equal to your Wisdom modifier. On a successful save, the fire goes out. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), the effect ends.", "Lightning. At the start of each of its turns for 1 minute, the target must make a Constitution saving throw against your druid spell save DC. On a failed save, it loses its reaction until the start of its next turn and the first attack that it makes on its turn is made at disadvantage. On a successful save, the effect ends."], "Adamantine Hide": ["Starting at 10th level, while you are transformed by Wild Shape, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks. In addition, you gain the ability to use Wild Shape as a reaction when you take damage, and the damage from that attack is applied to the hit points of your beast form."], "Constructed Perfection": ["Starting at 14th level, while you are transformed by Wild Shape, you can't be charmed, frightened, paralyzed, petrified, or poisoned. In addition, you are immune to poison damage."]}}, "Fighter": {"Gunslinger": {"Firearm Proficiency": ["Starting when you choose this archetype at 3rd level, you gain proficiency with firearms, allowing you to add your proficiency bonus to attacks made with firearms."], "Gunsmith": ["Upon choosing this archetype at 3rd level, you gain proficiency with Tinker’s Tools. You may use them to craft ammunition at half the cost, repair damaged firearms, or even draft and create new ones (DM’s discretion). Some extremely experimental and intricate firearms are only available through crafting."], "Firearm Properties": ["Firearms are a new and volatile technology, and as such bring their own unique set of Weapon Properties. Some properties are followed by a number, and this number signifies an element of that property. These properties replace the optional ones presented in the Dungeon Master’s Guide. Firearms are ranged weapons."], "Adept Marksman": ["When you choose this archetype at 3rd level, you learn to perform powerful Trick Shots to disable or damage your opponents using your firearms.", "Trick Shots. You learn two trick shots of your choice. Many maneuvers enhance an attack in some way. Each use of a trick shot must be declared before the attack roll is made. You can use only one trick shot per attack. You learn an additional trick shot of your choice at 7th, 10th, 15th, and 18th level. Each time you learn a new trick shot, you can also replace one trick shot you know with a different one.", "Grit. You gain a number of grit points equal to your Wisdom modifier (minimum of 1). You regain 1 expended grit point each time you roll a 20 on the d20 roll for an attack with a firearm, or deal a killing blow with a firearm to a creature of significant threat (DM’s discretion). You regain all expended grit points after a short or long rest.", "Saving Throws. Some of your trick shots require your targets to make a saving throw to resist the trick shot’s effects. The saving throw DC is calculated as follows:", "Trick shot save DC = 8 + your proficiency bonus + your Dexterity modifier"], "Quickdraw": ["When you reach 7th level, you add your proficiency bonus to your initiative. You can also stow a firearm, then draw another firearm as a single object interaction on your turn."], "Rapid Repair": ["Upon reaching 10th level, you learn how to quickly attempt to fix a jammed gun. You can spend a grit point to attempt to repair a misfired (but not broken) firearm as a bonus action."], "Lightning Reload": ["Starting at 15th level, you can reload any firearm as a bonus action."], "Vicious Intent": ["At 18th level, your firearm attacks score a critical hit on a roll of 19-20, and you regain a grit point on a roll of 19 or 20 on a d20 attack roll."], "Hemorrhaging Critical": ["Upon reaching 18th level, whenever you score a critical hit on an attack with a firearm, the target additionally suffers half of the damage from the attack at the end of its next turn."]}, "Renegade": {"Scoundrel’s Wit": ["Starting at 3rd level, you gain proficiency with the two of the following skills: Deception, Persuasion, or Sleight of Hand."], "Gunfighter Form": ["Additionally, when you choose this archetype at 3rd level, you begin constructing a custom firearm that suits your unique brand of renegade style. This process begins by selecting the form upon which to base your weapon. Each form grants you a new ability and unlocks certain upgrades you can add to your weapon at higher levels. Choose one of the following options:", "\nPistoleer: Favoring speed and style over raw power, a renegade who adopts the Pistoleer form wields a small flintlock handgun. As an action on your turn, you can target a creature within 30 feet and shoot. Make a ranged attack roll against the target. You are proficient with the attack, and on a hit, the attack deals piercing damage equal to 1d6 + your Dexterity modifier. The number of shots you can fire during a single action increases when you reach higher levels in this subclass: two shots at 5th level, three shots at 11th level, and four shots at 20th level. The shots can target the same creature or different creatures. Make a separate attack roll for each shot.\nSniper: Armed with a large two-handed firearm, a renegade who adopts the Sniper form can inflict massive damage in a single shot. As an action on your turn, you can target a creature within 120 feet and shoot. Make a ranged attack roll against the target. You are proficient with the attack, and on a hit, the attack deals piercing damage equal to 1d10 + your Dexterity modifier. You deal extra damage while using this form when you reach higher levels, dealing damage equal to 2d10 + your Dexterity modifier at 5th level, 4d10 at 11th level, and 6d10 at 20th level.\n"], "Weapon of Choice": ["Through a combination of salvaging stolen pieces of arcane technology and sheer rakish ingenuity, you can customize your firearm with various upgrades. When you choose this archetype at 3rd level, pick one minor upgrade and one major upgrade from the Firearm Upgrades list. If an upgrade has a prerequisite, you must meet that prerequisite in order to benefit from the upgrade.", "You gain one additional minor upgrade at 5th level, and one additional major upgrade at 10th level."], "Cunning Shot": ["Starting at 7th level, you learn to exploit a foe’s weak spots, even if they appear to have none. The damage dealt by your firearm, including damage dealt via Firearm Upgrades, ignores resistances and immunities."], "Grin and Bear It": ["At 10th level, you can brace yourself in the heat of battle, even when gravely wounded. When you use your Second Wind feature, your AC gains a +1 bonus and your movement speed increases by 10 feet until the start of your next turn."], "Right Gun for the Job": ["At 15th level, your skill with your firearm can adapt to any situation. When you finish a long rest, you can replace any of your Firearm Upgrades with a different one, though you cannot have more than two major upgrades equipped at a time. You must still meet the prerequisite of an upgrade in order to benefit from it."], "Light ‘Em Up": ["At 18th level, you learn to channel the volatile force of your firearm’s black powder into a single concussive blast. As a bonus action, you can either throw or set down a small explosive. If thrown, the explosive has a range of 30 feet and detonates immediately on impact; if set down, the explosive can be detonated remotely from up to 60 feet away as another bonus action.", "When detonated, each creature within a 15-foot radius of the explosive must make a Dexterity saving throw, taking 12d6 force damage on a failure and half as much on a success. The DC for this saving throw is equal to your Firearm Upgrade DC.", "Once you use this feature, you cannot use it again until you complete a short or long rest."]}}, "Monk": {"Way of the Cobalt Soul": {"Extract Aspects": ["Starting at 3rd level, you can strike pressure points to intuit crucial information about a foe. When you hit a creature with one of the attacks granted by your Flurry of Blows, you can analyze it. Whenever an analyzed creature misses you with an attack, you can immediately use your reaction to make an unarmed strike against that creature if it's within your reach. This benefit lasts until you finish a short or long rest.", "Additionally, when you analyze a creature, you learn all of its damage vulnerabilities, damage resistances, damage immunities, and condition immunities."], "Extort Truth": ["Starting at 6th level, you can precisely strike a hidden cluster of nerves on a creature, temporarily preventing it from masking its true thoughts and intent. When you hit a creature with an unarmed strike, you can spend 1 ki point to force it to make a Charisma saving throw. On a failed save, the creature is unable to speak a deliberate lie, and all Charisma checks directed at the creature are made with advantage for up to 10 minutes. You know if it succeeded or failed on its saving throw.", "And affected creature is aware of the effect and can thus avoid answering questions to which it would normally respond with a lie. Such a creature can be evasive in its answers as long as the effect lasts.", "If you wish to impose this effect on a creature without injuring it, you can attack the creature to simply touch it, dealing no damage on a hit."], "Mystical Erudition": ["Also at 6th level, you have extensively studied the history and lore within the archives of the Cobalt Soul. You learn one language of your choice, and you gain proficiency with one of the following skills of your choice: Arcana, History, Investigation, Nature, or Religion. If you already have proficiency in one of the listed skills, you can instead choose to double your proficiency bonus for any ability check you make that uses the chosen skill.", "You gain an additional language and an additional skill proficiency from the above list (or you can double the bonus of an existing proficiency from the list) at 11th and 17th level."], "Mind of Mercury": ["Starting at 11th level, you've honed your awareness and reflexes through mental aptitude and pattern recognition. Once per turn, if you've already taken your reaction, you may spend 1 ki point to take an additional reaction. You can use only one reaction per triggering effect."], "Debilitating Barrage": ["Upon reaching 17th level, you've gained the knowledge to manipulate a creature's ki to undermine their fortitude. When you hit a creature with an unarmed strike, you can spend 3 ki points to cause the creature to gain vulnerability to one damage type of your choice for 1 minute, or until the end of a turn in which it has taken damage of that type.", "If a creature has resistance to the damage type you choose, this resistance is suppressed for 1 minute, rather than gaining vulnerability. A creature that is immune to the damage type you choose is unaffected. A creature who is affected by this feature cannot be affected by it again for 24 hours."]}, "Way of the Living Weapon": {"Fists of Bone and Steel": ["At 3rd level, when you choose this tradition, your Martial Arts damage die increases for unarmed strikes. You can roll a d6 in place of the normal damage for your unarmed strike. This die changes to a d8 at 5th level; a d10 at 11th level; and a d12 at 17th level. This increased damage can only be applied to an unarmed strike, and not to a monk weapon."], "Martial Discipline": ["Starting at 3rd level, when you adopt this tradition, choose a discipline and gain its feature.", "\nForged Heart. Your unarmed strikes are considered adamantine weapons. In addition, when you hit a creature with an unarmed attack, you can spend 1 ki point to cause it to make a Strength saving throw. On a failed save, the creature takes 2d6 additional damage of the same type as the unarmed strike and can be pushed up to 15 feet away from you. On a successful save, the creature only takes 1d6 points of additional damage and is not pushed back.\n", "\nNightmare Shroud. When you hit a creature with an unarmed attack, you can spend 1 ki point to assail it with fear, causing it to make a Wisdom saving throw. On a failed save, it takes 1d6 points of psychic damage and becomes frightened of you until the end of your next turn. If a creature succeeds on this save, they are immune to the fear effect of this ability for 24 hours.\n", "\nTraveler’s Blade. Your reach extends by 5 feet. Additionally, at the start of your turn you can expend up to 4 ki points to extend your reach further. For every point of ki you spend, your reach extends by an additional 5 feet until the end of your turn.\n", "\nWeretouched. Once per turn, when you hit a creature with an unarmed attack, you can spend 1 ki point to rend your target and inflict deep bleeding wounds. At the start of each of the creature’s turns for the next minute, it takes 1d4 points of slashing damage from this effect. The effect ends early if the creature has one or more hit points restored, if any creature uses its action to expend one use of a healer’s kit, or makes a successful Wisdom (Medicine) check with a DC equal to your ki save DC.\n\nWhen you reach 6th level, this slashing damage counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n"], "Mutable Strike": ["You have the power to alter your natural weapons, growing claws or reinforcing your fists. Starting at 3rd level, when you use Martial Arts to make an unarmed strike, you can choose whether you inflict slashing, bludgeoning, or piercing damage with the attack."], "Manifest Blow": ["Starting at 6th level, choose one of the following damage types when you finish a long rest: bludgeoning, piercing, slashing, cold, lightning, necrotic, psychic, or thunder. On your turn, the first creature you hit with an unarmed strike takes an additional 1d6 points of damage of that type. If you select bludgeoning, piercing, or slashing damage, it benefits from your Ki-Empowered Strikes class feature and counts as magical damage. Nightmare Shroud monks typically inflict psychic damage with this ability, Forged Heart monks enhance their bludgeoning damage, and Weretouched grow sharper claws. However, you can choose any damage type, regardless of your discipline(s)."], "Reflexive Adaptation": ["Starting at 11th level, when you make a Strength (Athletics) or Dexterity (Acrobatics) check, you can spend 1 ki point to roll an additional d20. You can choose to use this ability after you roll the check, but before the outcome is determined. You choose which of the d20s is used for the ability check, omitting the highest if this check was rolled with disadvantage.\nIn addition, the extra damage dealt by the Manifest Blow class feature increases to 2d6."], "Perfect Form": ["At 17th level, you transform your body to become a weapon of war. You gain a feature based on a discipline of your choice. You can choose the same discipline you selected at 3rd level or a different one.", "\nForged Heart. When you are hit by an attack, you can use your reaction to add your Wisdom modifier (minimum of 1) to your AC, including against the triggering attack. This effect lasts until the start of your next turn.\n", "\nNightmare Shroud. When you damage a creature with your Manifest Blow, excess psionic energy ripples to up to 3 different creatures of your choice within 30 feet. Those creatures take an amount of psychic damage equal to half of your monk level.\n", "\nTraveler’s Blade. When you deal piercing or slashing damage to a creature with an unarmed strike, it takes an additional 1d8 poison damage and must succeed on a Constitution saving throw against your ki save DC or be poisoned until the end of its next turn.\n", "\nWeretouched. When you use your Flurry of Blows, you can make three unarmed strikes as a bonus action instead of two. You have advantage on these attacks.\n"]}, "Way of the Soul Knife": {"Soul Knives": ["Starting when you choose this tradition at 3rd level, you can use your psionic energy to manifest blades that disrupt your foes’ minds.", "Your unarmed strikes deal your choice of psychic, piercing, slashing, or bludgeoning damage each time you hit.", "In addition, you can use a bonus action to increase the reach of your unarmed strikes by 30 feet until the end of your turn."], "Psychic Slash": ["At 3rd level, when you channel ki into your attacks you augment your soul knives to inflict devastating psionic blows.", "Whenever you hit a creature with one of the attacks granted by your Flurry of Blows and that attack inflicts psychic damage, you can impose one of the following effects on the target:", "\nLife Drain. You gain temporary hit points equal to half the damage your attack deals.\n", "\nInvoke Terror. The target must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn.\n", "\nInvoke Wrath. The target suffers disadvantage on all attack rolls against targets other than you until the end of your next turn.\n", "\nAstral Slide. You teleport the target up to 10 feet to a destination you can see.\n", "\nSynaptic Overload. The target gains vulnerability to psychic damage until the end of your next turn.\n"], "Aura Sight": ["At 6th level, you gain the ability to perceive the auras of other creatures.", "As an action, select a creature that you can see. That creature makes a Wisdom saving throw, though it has no knowledge that you forced it to attempt this saving throw. On a failed save, you learn if the creature shares any aspects of its alignment with you, its current hit points, and its current attitude and intentions toward you or one other creature, object, or location of your choice. In addition, for the next 24 hours or until you use this ability again, you can use an action to determine the creature’s distance and direction from you.", "If a creature succeeds on its saving throw against this ability, you cannot use this ability against that creature again until you complete a long rest."], "Spectral Blades": ["At 11th level, you can cause your blades to phase through physical objects and defenses.", "Once during your turn, you can choose to forego one unarmed strike in place of forcing a creature within the reach of that attack to make a Dexterity saving throw against your ki save DC. On a failed saving throw, the creature takes psychic damage equal to that of your unarmed strike, or half that damage if it succeeds."], "Psychic Form": ["At 17th level, you can transform your physical body into the same psychic energy that comprises your soul knives. As a bonus action, you assume a psychic form, which grants the following benefits:", "\nYou have resistance to all damage.\n", "\nYou have a fly speed of 30 feet.\n", "\nYou can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object.\n", "This benefit lasts for 1 minute. You cannot use it again until you complete a long rest."]}}, "Paladin": {"Oath of the Open Sea": {"Tenets of the Open Sea": ["No Greater Life than a Life Lived Free. One should be free to chart their own path without oppression. Those who would exert their power to dominate others shall be smote.", "Trust the Skies. The guidance of a strong breeze. The rumbling warnings of a coming storm. Nature is a source of portent and council that should be heeded.", "Adapt like the Water. The waters of the ocean can shift around any obstacle or become an impassable one. They can carve around and reveal the secrets of the past or swallow the truth and hide it forever. To embrace this fluidity is to be ready for any challenge.", "Explore the Uncharted. The world is filled with much mystery. Through the pursuit of these enigmatic ends, one can both uncover those who hide their dark deeds in shadow to be judged, and find the path to becoming something great."], "Oath Spells": ["You gain oath spells at the paladin levels listed."], "Channel Divinity": ["When you take this oath at 3rd level, you gain the following two Channel Divinity options.", "\nMarine Layer. As an action, you channel the sea to create a thick cloud of fog that surrounds you for 20 feet in all directions. The fog moves with you, remaining centered on you and making its area heavily obscured. You and each creature within 5 feet of you instead treat the area as lightly obscured. This fog lasts for 10 minutes, spreads around corners, and cannot be dispersed unless you choose to end this effect (no action required).\nFury of the Tides. As a bonus action, you channel the powerful might of the waves to bolster your attacks for 1 minute. Once per turn for the duration, when you hit a creature with a weapon attack, you can choose to push the target 10 feet away from you. If pushed into an obstacle or another creature, the target takes bludgeoning damage equal to your Charisma modifier.\n"], "Aura of Liberation": ["Starting at 7th level, you fill nearby creatures with the energy of movement. While you’re not incapacitated, you and creatures of your choice within 10 feet of you cannot be grappled or restrained, and ignore penalties on movement and attacks while underwater. Creatures that are already grappled or restrained when they enter the aura can spend 5 feet of movement to automatically escape unless they are bound by magic restraints.", "When you reach 18th level in this class, the aura affects creatures within 30 feet of you."], "Stormy Waters": ["At 15th level, you can call on the force of crashing waters as a reaction whenever a creature moves into or out of your reach. The creature takes 1d12 bludgeoning damage and must succeed on a Strength saving throw against your spell save DC or be knocked prone."], "Mythic Swashbuckler": ["At 20th level, you learn to channel the spirits of historic sea captains to briefly become a paragon of heroic adventure. As an action, you embrace these spirits of the sea to gain the following benefits for 1 minute:", "\nYou have advantage on Strength (Athletics) checks and you gain a climbing speed equal to your walking speed. If you already have a climbing speed, it is doubled.\nIf you are within 5 feet of a creature and no other creatures are within 5 feet of you, you have advantage on attack rolls against that creature.\nYou can take the Dash or Disengage action as a bonus action.\nYou have advantage on Dexterity checks and Dexterity saving throws against effects you can see.\n", "Once you use this feature, you can’t use it again until you finish a long rest."]}}, "Ranger": {}, "Rogue": {"Wild Card": {"Tricks Up the Sleeve": ["Your penchant for games has afforded you the ability to subtly manipulate fortune to your favor. When you choose this archetype at 3rd level, you learn the Guidance cantrip. Starting at 9th level, it has a range of 30 feet for you, and you can cast it as a bonus action."], "Wild Card’s Gambit": ["Also at 3rd level, you gain proficiency with one of the following gaming sets: dice set, dragonchess set, or playing card set.", "The gaming set you choose grants you a Wild Card’s Gambit, as detailed below. If you are proficient in multiple types of gaming sets, you must choose which gambit to use when you gain this feature. You can change your choice of gambit whenever you gain a level in this class.", "\nLoaded Dice: You gain a pool of d6s equal to the number of d6s you roll for your Sneak Attack damage. (Your pool starts with 2d6 at 3rd level, and increases to 3d6 at 5th level, and so on.) When a creature targets you with an attack, you can use your reaction to spend one die from the pool and subtract the number rolled from the attack. You can choose to use this feature after the creature makes its roll, but before the DM determines whether the attack roll hits or misses. Starting at 9th level you can spend up to two dice from the pool at once, and starting at 17th level you can spend up to three dice at once. You regain all expended dice from your loaded dice pool when you complete a long rest.\n", "\nDragonchess: Your prowess of the chessboard has made you a skilled tactician on the battlefield. As a bonus action on your turn, you can execute one of the following chess maneuvers. You can use a bonus action in this way a number of times equal to your Charisma modifier (minimum of once), and regain all uses after a long rest.\n\nDragon: Choose a creature you can see within 30 feet of you. The first time that creature makes a successful attack roll before the start of your next turn, they deal extra damage equal to your level in this class.\nGriffon: Your movement speed increases by 10 feet, and your movement does not provoke opportunity attacks. These benefits last until the start of your next turn.\nSylph: You and all friendly creatures within 5 feet of you have advantage on Dexterity saving throws until the start of your next turn.\n\n\n", "\nPlaying Cards: You have developed a fighting style based around the cartomancy of the Serpent Isles. You have your own deck of enchanted cards, and can make their edges razor-sharp with a flick of your wrist. If you have not yet used your Sneak Attack this turn, you can use your action to take one of these cards and attack a creature within 30 feet with it. The attack roll for this feature uses your Dexterity modifier, and on a hit, it deals slashing damage equal 1d4 + your Dexterity modifier. When you roll for damage, look at the number rolled on the d4. The attack gains a random effect based on the number rolled, as detailed in the Wild Card Suit table below. You can attack using a card in this manner a number of times equal to your Charisma modifier (minimum of once), and regain all uses after a long rest.\n"], "Shifting the Odds": ["Starting at 9th level, you are acutely aware of how to quit when you’re ahead, vanishing in a flash when the odds begin to turn against you. As a bonus action, you can disappear with a dramatic flourish. Each creature within 10 feet of you must make a Dexterity saving throw (DC 8 + your proficiency bonus + your Charisma modifier), taking 4d10 force damage on a failed save or half as much on a successful one.", "You then teleport yourself to an unoccupied space that you can see within 120 feet of your original location. Once you have used this ability, you cannot use it again until you have finished a short or long rest."], "Twist of Fate": ["At 13th level, your mastery over the game table hones your speed and cunning in combat. After rolling initiative but before the first turn of combat, you can choose to swap places in the initiative order with one creature you can see. If the creature is one of your allies, that ally must agree to swapping initiative with you."], "Joker Wild": ["At 17th level, your mastery over chance encompasses even your own form, allowing you to exist between potential realities. As a bonus action on your turn, you can take on an incorporeal form, during which you gain the following benefits:", "\nYou regain expended power for your Wild Card’s Gambit feature:\n\nCards. You regain all spent uses of that feature.\nDragonchess. You regain all spent uses of that feature.\nDice. You regain all spent dice.\n\n\nYour movement speed is doubled.\nYou gain resistance to all damage, and are immune to the grappled, paralyzed, stunned, and restrained conditions.\nYou can move through objects and creatures as if they were difficult terrain. If you end your turn inside a creature, the creature takes 1d10 force damage and is shunted into an adjacent space within 5 feet of their original location.\n", "This incorporeal state lasts for one minute, or until you are incapacitated. Once you use this feature, you cannot use it again until you complete a long rest."]}}, "Sorcerer": {"Runechild": {"Essence Runes": ["At 1st level, your body has begun to express your innate magical energies as natural runes that hide beneath your skin. You begin with 1 Essence Rune, and gain an additional rune whenever you gain a level in this class. Runes can manifest anywhere on your body, though the first usually manifests on the forehead. They remain invisible when inert.", "At the end of a turn where you spent any number of sorcery points for any of your class features, an equal number of essence runes glow with stored energy, becoming charged runes. If you expend a charged rune to use one of your Runechild features, it returns to being an inert essence rune.", "As a bonus action, you may spend any number of sorcery points to convert an equal number of essence runes into charged runes. If you have no sorcery points and no charged runes, you can convert a single essence rune into a charged rune as an action.", "If you have 5 or more charged runes, you emit bright light in a 5 foot radius and dim light for an additional 5 feet. Any charged runes revert to inert essence runes after you complete a long rest."], "Glyphs of Aegis": ["Beginning at 1st level, you can release the stored arcane power within your runes to absorb or deflect threatening attacks against you. Whenever you take damage from an attack, hazard, or spell, you can use a reaction to expend any number of charged runes, rolling 1d6 per charged rune. You subtract the total rolled from the damage inflicted by the attack, hazard, or spell.", "At 6th level, you can use an action to expend a charged rune, temporarily transferring a Glyph of Aegis to a creature you touch. A creature can only hold a single glyph, and it lasts for 1 hour, or until the creature is damaged by an attack, hazard, or spell. The next time that creature takes damage from any of those sources, roll 1d6 and subtract the number rolled from the damage roll. The glyph is then lost."], "Sigilic Augmentation": ["Upon reaching 6th level, you can channel your runes to temporarily bolster your physical capabilities. You can expend a charged rune as a bonus action to enhance either your Strength, Dexterity, or Constitution, granting you advantage on ability checks with the chosen ability score until the start of your next turn. You can choose to maintain this benefit additional rounds by expending a charged rune at the start of each of your following turns."], "Manifest Inscriptions": ["At 6th level, you can reveal hidden glyphs and enchantments that surround you. As an action, you can expend a charged rune to cause any hidden magical marks, runes, wards, or glyphs within 15 feet of you to reveal themselves with a glow for 1 round. This glow is considered dim light for a 5 foot radius around the mark or glyph."], "Runic Torrent": ["Upon reaching 14th level, you can channel your stored runic energy to instill your spells with overwhelming arcane power, bypassing even the staunchest defenses. Whenever you cast a spell, you can expend a number of charged runes equal to the spell’s level to allow it to ignore any resistance or immunity to the spell’s damage type the targets may have."], "Arcane Exemplar Form": ["Beginning at 18th level, you can use a bonus action and expend 6 or more charged runes to temporarily become a being of pure magical energy. This new form lasts for 3 rounds plus 1 round for each charged rune expended over 6. While you are in your exemplar form, you gain the following benefits:", "\nYou have a flying speed of 40 feet.\n", "\nYour spell save DC is increased by 2.\n", "\nYou have resistance to damage from spells.\n", "\nWhen you cast a spell of 1st level or higher, you regain hit points equal to the spell’s level.\n", "When your Arcane Exemplar form ends, you can’t move or take actions until after your next turn, as your body recovers from the transformation. Once you use this feature, you must finish a long rest before you can use it again."]}, "Runechild Reborn": {"Essence Runes": ["At 1st level, your body begins to express your innate magic as runes traced out across your skin. You start with 1 essence rune, and gain an additional rune whenever you gain a level in this class. These runes can manifest anywhere on your body, though the first usually manifests on the forehead. Your essence runes remain invisible when inert.", "At the end of a turn during which you spent one or more sorcery points, a number of your essence runes equal to the number of sorcery points you spent begin to glow with stored energy, becoming charged runes. You use these charged runes to power your Runechild subclass features. Also, as a bonus action, you may spend a sorcery point to convert two essence runes into two charged runes.", "If you have 5 or more charged runes, you emit bright light in a 5-foot radius and dim light for an additional 5 feet.", "If you expend a charged rune to use one of your Runechild features, it returns to being an inert essence rune. Any charged runes also revert to inert essence runes after you finish a long rest."], "Runic Magic": ["Beginning at 1st level, you learn additional spells when you reach certain levels in this class, as shown on the Runic Spells table. Each of these spells counts as a sorcerer spell for you, but it doesn’t count against the number of sorcerer spells you know.", "When you gain a level in this class, you can replace one spell you gained from this feature with another spell of the same level. The new spell must be an abjuration or transmutation spell from the Sorcerer, Warlock, or Wizard spell list."], "Glyphs of Aegis": ["Starting at 1st level, you can release the stored arcane power within your runes to absorb or deflect threatening attacks. Whenever you take damage, you can expend any number of charged runes as a reaction. Roll a number of d6s equal to the number of runes you expended, and reduce the damage by the total.", "When you reach 6th level, you can touch a creature as an action and expend up to 3 charged runes to transfer your protective power to it for up to 1 hour. The next time that creature takes damage within the next hour, it rolls 1d6 per charged rune spent and reduces the damage by the total. You can’t transfer this power to a creature already under the effect of Glyph of Aegis.", "Your Glyph of Aegis die becomes a d8 at 14th level."], "Sigilic Augmentation": ["At 6th level, you can channel your runes to temporarily bolster your physical capabilities. When you make a Strength, Dexterity, or Constitution ability check, you can expend a charged rune as a reaction to gain advantage on the roll.", "In addition, when you are forced to make a Strength, Dexterity, or Constitution saving throw, you can use your reaction and expend a charged rune to gain advantage on the saving throw. Once you use this feature in this way, you can't use it in this way again until you complete a long rest."], "Manifest Inscriptions": ["Also at 6th level, you can reveal hidden glyphs and enchantments that surround you. As an action, you expend one charged rune to reveal hidden or invisible arcane traps, marks, runes, wards, sensors, or glyphs within 60 feet of you. They glow with dim light in a 5-foot radius for 1 minute.", "You have advantage on Intelligence (Arcana) checks to discern the nature of any magic revealed in this way for the duration. If the glyphs you reveal mean something in a language you can’t read, you can understand them while they are glowing as if you knew that language."], "Runic Torrent": ["Upon reaching 14th level, you can channel runic energy to overpower even the staunchest defenses. When you cast a spell, you can expend 2 charged runes to cause the spell to deal force damage instead of its usual damage types. Additionally, all creatures targeted by the spell or within the spell’s area must succeed on a Strength saving throw against your spell save DC or be knocked prone or pushed up to 15 feet away from the spell's point of origin (your choice).", "Once you use this feature, you can't do so again until you complete a short or long rest."], "Arcane Exemplar": ["Starting at 18th level, you can use a bonus action and expend a charged rune to become a being of pure magical energy. While in your exemplar form, you gain the following benefits:", "\nYou have a flying speed of 60 feet.\nCreatures have disadvantage on saving throws against your sorcerer spells.\nYou have resistance to damage dealt by spells.\nWhenever you cast a spell of 1st level or higher, you regain hit points equal to the spell’s level.\n", "Your exemplar form lasts until the end of your turn. However, you can expend a charged rune at the end of your turn (no action required) to extend the duration until the end of your next turn. When your exemplar form ends, you are stunned until the end of your next turn.", "Once you use this feature, you can’t use it again until you complete a long rest."]}}, "Warlock": {"Kraken": {"Expanded Spell List": ["The Kraken lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you."], "Grasp of the Kraken": ["Starting at 1st level, you gain the ability to call forth spectral tentacles that grab at your foes. As an action, pick a point you can see within 60 feet of you. A horde of grasping tendrils appears at that point. Creatures of your choice within 10 feet of that point must make a Strength saving throw against your warlock spell save DC. Creatures that fail their saving throws are grappled for 1 minute or until you use this ability again. The spectral tentacle's Strength (Athletics) bonus is 2 + your proficiency bonus and its reach is 10 feet."], "Inky Escape": ["At 6th level, you gain the ability to call upon your patron to escape from your foes. As a reaction when you take damage, you can cast Darkness centered on a point within 5 feet of you. The spell lasts until the end of your next turn, and it has no effect on your vision. Once you use this ability, you cannot use it again until you complete a short or long rest."], "Scion of the Depths": ["Starting at 10th level, your patron accepts you into its inner court of servitors. You gain the ability to breathe water and a swim speed equal to your normal speed. You gain immunity to lightning damage. When your immunity reduces damage from an effect to 0, you can use your reaction to cause creatures of your choice that you can see within 30 feet of you to take lightning damage equal to your Charisma modifier + your proficiency bonus."], "Unleash the Kraken": ["At 14th level, you gain the ability to call upon your patron for aid. As an action, you open a portal at a point you can see within 30 feet of you and choose one of the following effects.", "\nTransport. You and up to 5 willing creatures of your choice that you can see are grasped by tentacles that emerge from the portal. A second portal opens at a point of your choice within 100 miles that you have visited within the past 24 hours. A second portal opens, depositing you and your chosen allies there.\n", "\nFury. The tentacles slam onto your foes. Pick up to 5 creatures that you can see within 30 feet of the portal. Those creatures must make Dexterity saving throws against your warlock spell save DC. Creatures that fail their saving throw take 10d6 bludgeoning damage and are restrained for 1 minute. Those that succeed take half the bludgeoning damage and are not restrained. On its turn, a restrained creature can use its action to attempt a DC 15 Strength (Athletics) or Dexterity (Acrobatics) check to end the restrained condition.\n", "Once you use this ability, you cannot use it again until you complete a long rest."]}}, "Wizard": {"Blood Magic": {"Blood Channeling": ["When you choose this arcane tradition at 2nd level, you are able to use your own depleted life essence to channel your magical abilities. Whenever your current hit points are below your hit point maximum, you can use your own body as an arcane focus.", "In addition, when casting a wizard spell that requires a costly material component, you can forego the component by taking 1d10 necrotic damage per 50 gp of the cost of the component (minimum 1d10). This damage can’t be reduced in any way. If this damage reduces you to 0 hit points, the spell fails but the spell slot is not expended."], "Sanguine Burst": ["Also at 2nd level, you learn how to weave your life force into a spell you cast, boosting its intensity at the cost of your vitality. Whenever you roll damage for a spell you’ve cast of 1st level or higher, you can choose to take necrotic damage equal to the spell’s level to reroll a number of the damage dice up to your Intelligence modifier (minimum one). This damage can’t be reduced in any way, and you must use the new rolls."], "Bond of Mutual Suffering": ["At 6th level, when a creature you can see hits you with an attack, you can use your reaction to bind your vitality to the attacker and force them to share your pain. The attacker takes damage equal to the damage you took.", "This feature cannot be used against constructs or undead. You can use this feature once. You must finish a short or long rest before you can use it again.", "At 14th level, you can use this feature twice between rests."], "Glyph of Hemorrhaging": ["Starting at 10th level, when you damage a creature with a spell, you can choose to curse that creature for 1 minute. While cursed in this way, whenever the creature is hit by an attack, it takes an extra 1d6 necrotic damage. At the end of each of the creature’s turns, it can make a Constitution saving throw against your spell save DC, ending the curse on a success.", "This feature cannot be used against creatures that are undead or constructs. Once you use this feature, you can’t use it again until you finish a short or long rest."], "Thicker than Water": ["Upon reaching 14th level, the blood that flows through your veins is empowered with arcane vigor that mends wounds and helps preserve your life. Whenever a spell or magical effect causes you to regain hit points, you regain an additional number of hit points equal to your proficiency bonus.", "In addition, while you are concentrating on a spell, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."]}}}